<script setup lang="ts">
const { items, activeId, scrollTo } = useTableOfContents();
</script>

<template>
	<UContainer>
		<article
			class="prose dark:prose-invert min-w-full prose-blockquote:border-primary prose-li:marker:text-primary prose-blockquote:font-extralight prose-blockquote:italic prose-blockquote:text-primary prose-h1:uppercase prose-h1:mt-4"
		>
			<!-- ОСНОВНЫЕ ПРАВИЛА -->
			<AppHeading :level="1" subtitle="Core Rules">Основные правила</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />
			<p>
				<strong>Warhammer 40,000: Kill Team</strong> — это тактическая скирмиш-игра. Команды специализированных оперативников участвуют в ожесточённых перестрелках и ближних боях с постоянным
				обменом атаками, где аккуратное перемещение и позиционирование будут необходимы, чтобы использовать Укрытие и захватывать жизненно важные цели.
			</p>

			<!-- Двухколоночный лейаут: комментарии слева, контент справа -->
			<TwoColumnLayout :reverse-on-mobile="false">
				<template #left>
					<AppBlockquote>В основных правилах вы найдёте множество боковых заметок, подобных этой. Это заметки дизайнеров, призванные дать вам больше контекста и понимания. </AppBlockquote>
					<AppBlockquote>
						При чтении основных правил вы можете встретить термины, с которыми вы не знакомы. Они объяснены в алфавитном порядке в разделе «Ключевые принципы» (стр. 46–55), а также есть
						удобный указатель правил в разделе Приложения (стр. 106–107). Не беспокойтесь об этом поначалу — продолжайте чтение, чтобы получить общее представление о том, как протекает
						игра.
					</AppBlockquote>
				</template>

				<template #right>
					<p>Чтобы сыграть партию в Kill Team, вам потребуется следующее:</p>
					<ul>
						<li>Килл тим — коллекция миниатюр Citadel (оперативников) для каждого игрока.</li>
						<li>
							Их сопутствующие правила (доступны бесплатно на английском языке на официальном сайте
							<a href="https://www.warhammer-community.com/en-gb/downloads/kill-team/" target="_blank">warhammer-community.com</a> ).
						</li>
						<li>Измерительное устройство в дюймах.</li>
						<li>Минимум 10 шестигранных кубиков (D6).</li>
						<li>Токены и маркеры.</li>
						<li>Киллзона — игровое поле и элементы террейна.</li>
						<li>Набор миссий.</li>
					</ul>
					<p>
						Каждая игра имеет последовательность, которая показывает, как подготовить игровую зону, подготовить ваш килл тим и добиться победы. Это можно найти на стр. 110 для наборов
						миссий в этой книге, тогда как другие наборы миссий будут иметь игровую последовательность, представленную отдельно.
					</p>
					<p>
						Основным этапом игровой последовательности является сражение, в котором ваши оперативники сражаются друг с другом, и вы пытаетесь добиться победы. Сражение состоит из
						нескольких Переломных Моментов, и каждый Переломный Момент включает Стратегическую фазу и Боевую фазу. Они должны быть выполнены по порядку и полностью, после чего Переломный
						Момент заканчивается и начинается следующий. Повторяйте этот процесс, пока сражение не закончится, как указано в вашем наборе миссии.
					</p>
					<p>
						<strong>ПОВТОРЯТЬ ДО ОКОНЧАНИЯ БИТВЫ:</strong>
					</p>
					<ul>
						<li>НАЧАЛО ХОДА</li>
						<li>ФАЗА СТРАТЕГИИ</li>
						<li>ФАЗА БОЯ</li>
						<li>ЗАВЕРШЕНИЕ ХОДА</li>
					</ul>
				</template>
			</TwoColumnLayout>
			<!-- ОСНОВНЫЕ ПРАВИЛА /-->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!-- ФАЗА СТРАТЕГИИ -->
			<AppHeading :level="2" subtitle="Strategy Phase">Стратегическая фаза</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />
			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>
						В некоторых наборах миссий вы также будете определять Инициативу при подготовке сражения. Игрок с Инициативой определяет порядок распределения одновременных правил, которые
						происходят до начала сражения.
					</AppBlockquote>
				</template>

				<template #right>
					<AppHeading :level="3" subtitle="Initiative">1. Инициатива</AppHeading>

					<ul>
						<li>
							Игрок с Инициативой активируется первым в Переломном Моменте и определяет порядок распределения правил, которые происходят одновременно. В первом Переломном Моменте игрок с
							Инициативой определяется игровой последовательностью вашего набора миссии. В последующих Переломных Моментах игроки проводят Жеребьёвку, и победитель определяет, у кого
							Инициатива. Однако если при Жеребьёвке ничья, игрок, который не имел Инициативы в предыдущем Переломном Моменте, определяет, у кого Инициатива (это имеет Приоритет над
							Жеребьёвками и ничьими).
						</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>CP — ценный ресурс, используемый для активации дополнительных правил, называемых приёмами. </AppBlockquote>

					<AppBlockquote>Токен приказа, лежащий светлой стороной вверх, показывает, что оперативник находится в состоянии Готовый.</AppBlockquote>

					<div class="flex justify-center">
						<NuxtPicture src="/images/core-rules/tokens.png" format="webp" />
					</div>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Ready">2. Готовность</AppHeading>
					<ul>
						<li>Каждый игрок получает 1 командное очко (CP). В каждом ходе после первого, игрок без инициативы получает 2 CP. Неизрасходованные CP сохраняются.</li>
						<li>Каждый игрок приводит в готовность всех своих оперативников.</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<TwoColumnLayout>
				<template #right>
					<AppHeading :level="3" subtitle="Gambit">3. Гамбит</AppHeading>
					<ul>
						<li>
							Начиная с игрока, у которого есть Инициатива, каждый игрок по очереди либо использует
							<strong>СТРАТЕГИЧЕСКИЙ ГАМБИТ</strong>, либо пасует. Игроки повторяют этот процесс, пока оба не спасуют подряд. Стратегические приёмы являются наиболее распространённым
							<strong>СТРАТЕГИЧЕСКИМ ГАМБИТОМ</strong>, но может быть использовано любое правило с пометкой <strong>СТРАТЕГИЧЕСКИЙ ГАМБИТ</strong>. Вы не можете использовать каждый
							<strong>СТРАТЕГИЧЕСКИЙ ГАМБИТ</strong> более одного раза за Переломный Момент.
						</li>
					</ul>
				</template>
			</TwoColumnLayout>
			<!-- ФАЗА СТРАТЕГИИ /-->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!-- ФАЗА БОЯ -->
			<AppHeading :level="2" subtitle="Firefight Phase">Боевая фаза</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />
			<p>
				Игрок с Инициативой активирует одного готового дружественного оперативника. Когда эта активация заканчивается, его оппонент активирует одного из своих готовых дружественных
				оперативников. Игроки повторяют этот процесс, чередуя активации, пока все оперативники одного из игроков не станут истощёнными; в этом случае он может выполнять
				<strong>противодействие</strong> между оставшимися активациями оппонента. Когда все оперативники истощены, Боевая фаза заканчивается.
			</p>
			<AppHeading :level="3" class="mb-8 uppercase">КОГДА АКТИВИРУЕТСЯ ДРУЖЕСТВЕННЫЙ ОПЕРАТИВНИК: </AppHeading>
			<div class="flex flex-col gap-4 text-xs sm:text-sm lg:text-base">
				<div class="flex justify-center items-center">
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">1. Определение приказа</div>
					<div class="w-2/12 flex justify-center items-center">
						<Icon name="iwwa:arrow-down" class="rotate-270 text-primary" size="32" />
					</div>
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">2. Выполнение действий</div>
				</div>
				<div class="flex justify-center items-center">
					<div class="w-5/12 flex justify-center items-center">
						<Icon name="iwwa:arrow-down" class="rotate-180 text-primary" size="32" />
					</div>
					<div class="w-2/12 flex justify-center items-center">
						<p class="text-center text-[10px] sm:text-xs">повторять до истощения всех оперативников</p>
					</div>
					<div class="w-5/12 flex justify-center items-center">
						<Icon name="iwwa:arrow-down" class="text-primary" size="32" />
					</div>
				</div>
				<div class="flex justify-center items-center">
					<div class="bg-amber-500 dark:bg-amber-800 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">
						Активация следующего игрока
					</div>
					<div class="w-2/12 flex justify-center items-center">
						<Icon name="iwwa:arrow-down" class="text-primary rotate-90" size="32" />
					</div>
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">3. ИСТОЩЕНИЕ</div>
				</div>

				<div class="flex justify-center items-center">
					<div class="w-5/12 flex justify-center items-center">
						<Icon name="iwwa:arrow-down" class="text-primary rotate-180" size="32" />
					</div>
					<div class="w-2/12 flex justify-center items-center" />
					<div class="w-5/12 flex justify-center items-center" />
				</div>

				<div class="flex justify-center items-center">
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex flex-col justify-center gap-2 lg:gap-4">
						<span class="lowercase font-normal text-[8px] sm:text-[10px] lg:text-xs">* Если все ваши оперативники истощены, а у соперника нет, выполните: </span>ПРОТИВОДЕЙСТВИЕ
					</div>
					<div class="w-2/12 flex justify-center items-center" />
					<div class="w-5/12 flex justify-center items-center" />
				</div>
			</div>

			<AppHeading :level="3" subtitle="Determine order">1. Определение приказа</AppHeading>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>
						Назначение оперативникам правильного приказа — ключевой момент. По мере того как вы сыграете несколько игр, вы получите лучшее понимание того, когда использовать Боевой приказ,
						а когда — Скрытый приказ.
					</AppBlockquote>
				</template>

				<template #right>
					<ul>
						<li>
							<p>Выберите приказ оперативника (Боевой или Скрытый). Он будет находиться в этом приказе до своей следующей активации.</p>
						</li>
					</ul>
					<div class="flex flex-row w-full items-center gap-4 mb-2">
						<div class="w-16 min-w-16 shrink-0">
							<NuxtPicture src="/images/core-rules/Engage.png" format="webp" />
						</div>
						<p class="flex-1"><strong>Боевой:</strong> Оперативник может выполнять действия как обычно и может выполнять противодействие.</p>
					</div>
					<div class="flex flex-row w-full items-center gap-4">
						<div class="w-16 min-w-16 shrink-0">
							<NuxtPicture src="/images/core-rules/Conceal.png" format="webp" />
						</div>
						<p class="flex-1">
							<strong>Скрытый:</strong> Оперативник не может выполнять действия Выстрел и Наскок, и не может выполнять Противодействие. Однако он не является допустимой целью, находясь в
							укрытии.
						</p>
					</div>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<AppHeading :level="3" subtitle="Perform actions">2. Выполнение действий</AppHeading>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>
						Оперативник с APL 2 может выполнить действия Репозиционирование (1AP) и Выстрел (1AP), всего 2AP, но не может выполнить действия Отступление (2AP) и Выстрел (1AP), всего 3AP.
					</AppBlockquote>
				</template>

				<template #right>
					<ul>
						<li>
							<p>Оперативник выполняет действия. Пока оперативник делает это, он называется активным оперативником.</p>
						</li>
						<li>
							<p>
								Каждое действие стоит Очки действия (AP), и вы не можете потратить больше AP во время активации оперативника, чем его Предел Очков Действия (APL); см. датакарты на стр.
								48. Кроме того, оперативник не может выполнить одно и то же действие более одного раза за свою активацию — это называется ограничениями действий. Некоторые редкие
								правила будут изменять стоимость действий. Независимо от того, как изменяется AP, минимальная стоимость всегда составляет 0AP. Это имеет приоритет над всеми изменениями
								AP.
							</p>
						</li>
						<li>
							<p>
								Вам не нужно объявлять все действия оперативника при его активации. Вместо этого оперативник может выполнить действие, а затем вы решаете следующее действие после того,
								как увидите его эффект.
							</p>
						</li>
						<li>
							<p>
								Если действие объявлено или начато, но его невозможно завершить, действие отменяется. Вернитесь к состоянию игры до этого действия. Например, если оперативник начал
								движение, но не может завершить перемещение, верните оперативника туда, где он был до начала движения; считается, что он не выполнил это действие, и вы не потратили на
								него AP.
							</p>
						</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<AppHeading :level="3" subtitle="Expended">3. Истощение</AppHeading>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote> Токен приказа, лежащий тёмной стороной вверх, показывает, что оперативник истощён. </AppBlockquote>
					<div class="flex justify-center max-h-24 items-center">
						<NuxtPicture src="/images/core-rules/tokens.png" format="webp" class="h-fit" />
					</div>
					<AppBlockquote> Все ваши оперативники истощены, а у противника — нет? —> ПРОТИВОДЕЙСТВИЕ </AppBlockquote>
					<AppBlockquote> Противодействие не является активацией — это замена активации. Это различие важно; например, это означает, что ограничения действий не применяются. </AppBlockquote>
				</template>

				<template #right>
					<ul>
						<li>
							<p>Когда вы завершили активацию оперативника, этот оперативник становится истощённым. Пока оперативник истощён, он не является готовым.</p>
						</li>
					</ul>
					<div class="border border-primary px-6 m-6 bg-zinc-100 dark:bg-zinc-800">
						<AppHeading :level="4" subtitle="Сounteract">Противодействие</AppHeading>
						<p>
							Когда вы должны были бы активировать готового дружественного оперативника, если все ваши оперативники истощены, но у вашего оппонента всё ещё есть готовые оперативники, вы
							можете выбрать истощённого дружественного оперативника с Боевым приказом, чтобы выполнить действие за 1 ОД бесплатно (кроме Охраны). Каждый оперативник может выполнять
							противодействие только один раз за переломный момент. Во время противодействия этот оперативник не может перемещаться более чем на 2", либо должен быть размещён целиком в
							пределах 2", если он был удалён и размещён заново во время противодействия (это не является изменением его характеристики Передвижения и имеет приоритет над всеми другими
							правилами). Противодействие является необязательным, поэтому вы можете выбрать не выполнять его. В любом случае после этого активация переходит обратно к вашему оппоненту.
						</p>
					</div>
				</template>
			</TwoColumnLayout>

			<!-- ФАЗА БОЯ /-->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!-- ДЕЙСТВИЯ -->
			<AppHeading :level="2" subtitle="Actions">Действия</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />

			<p>
				Действия имеют эффекты (
				<Icon name="material-symbols:arrow-back-2" class="rotate-180 text-green-500 align-middle" /> ) и условия ( <Icon name="f7:rhombus-fill" class="text-red-500 align-middle" /> ).
				<Icon name="f7:rhombus-fill" class="text-red-500 align-middle" /> — это условия, которые должны быть выполнены, чтобы оперативник мог выполнить это действие, тогда как
				<Icon name="material-symbols:arrow-back-2" class="rotate-180 text-green-500 align-middle" /> — это эффекты, которые происходят, когда оперативник выполняет это действие, включая любые
				требования во время его выполнения.

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Если оперативник выполняет бесплатное действие вне своей активации, это не мешает ему выполнить это действие во время своей активации, и наоборот.
						</AppBlockquote>
					</template>

					<template #right>
						<p>Существует четыре типа действий: универсальные, уникальные, миссионные и бесплатные:</p>

						<ul>
							<li>
								<p>
									<strong>Универсальные действия</strong> — это наиболее распространённые действия, которые вы будете использовать, и которые могут выполняться всеми оперативниками,
									если не указано иное. Основные универсальные действия приведены на стр. 40–45.
								</p>
							</li>
							<li>
								<p><strong>Уникальные действия</strong> — это редкие действия в правилах вашего килл тима. Только указанные оперативники могут их выполнять.</p>
							</li>
							<li>
								<p>
									<strong>Миссионные действия</strong> — относятся конкретно к миссии или киллзоне, в которую вы играете. Если таковые имеются, они будут указаны в вашем наборе
									миссии, правилах киллзоны или в выбранном вами снаряжении.
								</p>
							</li>
							<li>
								<p><strong>Бесплатные действия</strong> — могут выполняться только тогда, когда это указано другим правилом, и применяются следующие правила:</p>

								<ul class="list-[circle]">
									<li>Условия действия должны быть выполнены.</li>
									<li>Оно не требует от оперативника тратить дополнительные AP для выполнения этого действия.</li>
									<li>
										Оперативник всё равно считается выполнившим это действие для всех остальных целей правил. Например, если он выполнил это действие во время своей активации, он
										не сможет выполнить его снова в течение этой активации.
									</li>
								</ul>
							</li>
						</ul>
					</template>
				</TwoColumnLayout>

				<AppHeading :level="3" subtitle="Universal actions">Универсальные действия</AppHeading>
				<TwoColumnLayout>
					<template #left>
						<div class="flex flex-col justify-between h-full">
							<AppBlockquote> Перемещение отрезками позволяет добиться большей точности и наглядности. </AppBlockquote>
							<AppBlockquote> Эти перемещения выполняются отрезками по прямой линии, а не по дуге вокруг угла. </AppBlockquote>
							<AppBlockquote> Эти движения выполняются с шагом по прямой, а не по дуге за углом. </AppBlockquote>
						</div>
					</template>

					<template #right>
						<ActionCard
							title="Репозиционирование"
							subtitle="Reposition"
							:level="4"
							:ap="1"
							:effects="[
								'<p>Переместите активного оперативника на расстояние до его характеристики Передвижения в место, где его можно разместить. Это должно быть сделано одним или несколькими отрезками по прямой линии, при этом длина каждого отрезка всегда округляется вверх до ближайшего дюйма.</p>',
								'<p>Он не может перемещаться в радиус контроля вражеского оперативника, если только один или несколько других дружественных оперативников уже не находятся в радиусе контроля этого вражеского оперативника; в этом случае он может перемещаться в радиусе контроля этого вражеского оперативника, но не может закончить там перемещение.</p>',
							]"
							:conditions="[
								'Оперативник не может выполнить это действие, находясь в радиусе контроля вражеского оперативника, либо в ту же самую активацию, в которую он выполнил действие Отступление или Наскок.',
							]"
						/>
						<div class="grid grid-cols-1 md:grid-cols-2 gap-4 mt-4">
							<figure class="m-0 flex flex-col items-center">
								<NuxtPicture src="/images/core-rules/move1.jpg" format="webp" />
								<figcaption class="text-sm text-center mt-2">
									Оперативник имеет характеристику Передвижения 6". Сначала он перемещается прямолинейным отрезком 2", чтобы обойти угол стены. Затем он перемещается прямолинейным
									отрезком 4" — это оставшееся расстояние, на которое он может переместиться, не превышая свою характеристику Передвижения.
								</figcaption>
							</figure>
							<figure class="m-0 flex flex-col items-center">
								<NuxtPicture src="/images/core-rules/move2.jpg" format="webp" />
								<figcaption class="text-sm text-center mt-2">
									Оперативник сначала перемещается прямолинейным отрезком 0,5", чтобы обойти угол стены, но так как отрезки всегда округляются вверх, это считается как 1". Затем он
									перемещается прямолинейным отрезком 2,75", который снова округляется вверх до 3". В итоге он переместился на 4" в сумме.
								</figcaption>
							</figure>
						</div>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Так как оперативники не могут выполнять одно и то же действие более одного раза за свою активацию, действие «Рывок» — это способ, позволяющий оперативникам перемещаться ещё
							дальше.
						</AppBlockquote>
					</template>

					<template #right>
						<ActionCard
							title="Рывок"
							subtitle="Dash"
							:ap="1"
							:effects="[
								'<p>То же самое, что действие Репозиционированние, за исключением того, что вместо характеристики Передвижения активного оперативника он может переместиться на расстояние до 3&Prime;. Кроме того, он не может выполнять взбирание во время этого перемещения, но может выполнять спуск и прыжок.</p>',
							]"
							:conditions="[
								'<p>Оперативник не может выполнить это действие, находясь в радиусе контроля вражеского оперативника, либо в ту же самую активацию, в которую он выполнил действие Наскок.</p>',
							]"
						/>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Если оперативник активируется, находясь в радиусе контроля вражеского оперативника, действие «Отступление» — это способ выйти из боя. Оно стоит 2AP, поэтому большинство
							оперативников не смогут выполнять другие действия в ту же активацию.
						</AppBlockquote>
					</template>

					<template #right>
						<ActionCard
							title="Отступление"
							subtitle="Fall back"
							:ap="2"
							:effects="[
								'<p>То же самое, что действие Репозиционированние, за исключением того, что активный оперативник может перемещаться в радиусе контроля вражеского оперативника, но не может закончить там перемещение.</p>',
							]"
							:conditions="[
								'<p>Оперативник не может выполнить это действие, если в радиусе его контроля нет вражеского оперативника. Он не может выполнить это действие в ту же самую активацию, в которую он выполнил действие Репозиционированние или Наскок.</p>',
							]"
						/>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Действие «Наскок» позволяет оперативникам эффективно сближаться с врагами, но так как для этого требуется Боевой приказ, они могут стать уязвимыми для вражеского выстрела
							позже.
						</AppBlockquote>
					</template>

					<template #right>
						<ActionCard
							title="Наскок"
							subtitle="Charge"
							:ap="1"
							:effects="[
								'<p>То же самое, что действие Репозиционированние, за исключением того, что активный оперативник может переместиться на дополнительные 2&Prime;</p>',
								'<p>Он может перемещаться и должен закончить перемещение в радиусе контроля вражеского оперативника. Если он перемещается в радиус контроля вражеского оперативника, в радиусе контроля которого нет других дружественных оперативников, он не может покинуть радиус контроля этого оперативника.</p>',
							]"
							:conditions="[
								'<p>Оперативник не может выполнить это действие, если находится в Скрытом приказе, если он уже находится в радиусе контроля вражеского оперативника, либо в ту же самую активацию, в которую он выполнил действие Репозиционированние, Рывок или Отступление.</p>',
							]"
						/>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Если существуют такие маркеры, к которым может быть выполнено действие Поднять маркер, это будет указано в других правилах, например в вашем пакете миссии.
						</AppBlockquote>
					</template>

					<template #right>
						<ActionCard
							title="Поднять маркер"
							subtitle="Pick up marker"
							:ap="1"
							:effects="[
								'<p>Уберите маркер, который контролирует активный оперативник и по отношению к которому может быть выполнено действие Поднять маркер. Этот оперативник теперь переносит, оспаривает и контролирует этот маркер.</p>',
							]"
							:conditions="['<p>Оперативник не может выполнить это действие, находясь в радиусе контроля вражеского оперативника, либо если он уже переносит маркер.</p>']"
						/>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote> Как указано выше, если существуют какие-либо маркеры, которые оперативник переносит, это будет указано в других правилах. </AppBlockquote>
					</template>

					<template #right>
						<ActionCard
							title="Разместить маркер"
							subtitle="Place marker"
							:ap="1"
							:effects="[
								'<p>Разместите маркер, который активный оперативник переносит, в пределах его радиуса контроля.</p>',
								'<p>Если оперативник, переносящий маркер, выведен из строя (см. урон на стр. 47), он должен выполнить это действие перед тем, как быть удалённым из киллзоны, но делает это за 0 ОД. Это имеет приоритет над всеми правилами, которые мешали бы ему это сделать.</p>',
							]"
							:conditions="[
								'<p>Оперативник не может выполнить это действие в ту же активацию, в которую он уже выполнил действие Поднять маркер (если только он не выведен из строя).</p>',
							]"
						/>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<div class="flex flex-col justify-between h-full">
							<AppBlockquote>
								Неудивительно, что килл тим может быть очень смертоносной игрой, поэтому если вы часто теряете оперативников от вражеской стрельбы, рассмотрите более оборонительный
								стиль игры — с оперативниками в укрытии и в Скрытом приказе.
							</AppBlockquote>

							<AppBlockquote>
								В редких случаях вы будете одновременно атакующим и защищающимся, например при стрельбе по дружественному оперативнику в результате правила оружия Взрывной. В этом
								случае вы бросаете и атакующие, и защитные кубики (а не ваш оппонент).
							</AppBlockquote>
							<AppBlockquote>
								Заслонённый означает, что атаковать вражеского оперативника через крупные препятствия менее эффективно. Однако это игнорируется, если оперативники находятся у таких
								препятствий — представьте, что они наклоняются из-за углов или стреляют через окна.
							</AppBlockquote>
							<AppBlockquote>
								Помните, что укрытие на этом этапе обычно применяется к оперативникам с Боевым приказом, так как Скрытый приказ вообще не позволил бы им быть допустимой целью.
							</AppBlockquote>
							<AppBlockquote>
								Некоторые виды оружия стреляют несколько раз за одно действие, например оружие с правилами Взрывной и Шквальный (стр. 111). Поэтому оперативники не удаляются до тех
								пор, пока всё действие не будет полностью распределено.
							</AppBlockquote>
						</div>
					</template>

					<template #right>
						<ActionCard
							title="Выстрел"
							subtitle="Shoot"
							:ap="1"
							:effects="[
								'<p>Выполните выстрел активным оперативником, следуя последовательности ниже. Игрок активного оперативника является атакующим. Игрок выбранного вражеского оперативника является защищающимся.</p>',
							]"
							:conditions="['<p>Оперативник не может выполнить это действие, если он находится в Скрытом приказе, либо находится в радиусе контроля вражеского оперативника.</p>']"
						/>

						<AppHeading :level="5" subtitle="select weapon" class="mt-7">1. Выбор оружия</AppHeading>
						<p>Атакующий выбирает одно дальнобойное оружие, которое есть у его оперативника, и собирает их атакующие кубики — количество D6, равное характеристике Atk этого оружия.</p>

						<AppHeading :level="5" subtitle="select valid target" class="mt-7">2. Выбор допустимой цели</AppHeading>
						<p>Атакующий выбирает вражеского оперативника, который является допустимой целью и в радиусе контроля которого нет дружественных оперативников.</p>
						<ul class="list-none p-0 flex flex-col gap-4">
							<li class="flex items-center gap-4">
								<div class="w-20 md:w-24 shrink-0">
									<NuxtPicture src="/images/core-rules/engage_2_sides.png" format="webp" class="w-full h-auto" />
								</div>
								<p class="m-0 flex-1">Если предполагаемая цель находится в Боевом приказе, она является допустимой целью, если она видима активному оперативнику.</p>
							</li>
							<li class="flex items-center gap-4">
								<div class="w-20 md:w-24 shrink-0">
									<NuxtPicture src="/images/core-rules/conceal_2_sides.png" format="webp" class="w-full h-auto" />
								</div>
								<p class="m-0 flex-1">
									Если предполагаемая цель находится в Скрытом приказе, она является допустимой целью, если она видима активному оперативнику и не находится в укрытии.
								</p>
							</li>
						</ul>
						<p>
							Оперативник является видимым, если активный оперативник может его видеть. Оперативник находится в укрытии, если между ним и активным оперативником есть террейн, находящийся
							на линии огня, в пределах его радиуса контроля. Однако он не может находиться в укрытии, если находится в пределах 2" от активного оперативника.
						</p>
						<p>
							Оперативник не может одновременно находиться в укрытии и быть заслонённым одним и тем же элементом террейна. Если это произошло бы, защищающийся должен выбрать одно из них
							(укрытие или заслонение) для этой последовательности, когда его оперативник выбирается в качестве допустимой цели.
						</p>

						<AppHeading :level="5" subtitle="roll range attack dice" class="mt-7">3. Бросок атакующих кубиков </AppHeading>
						<p>
							Атакующий бросает свои атакующие кубики. Каждый результат, равный или превышающий характеристику Hit оружия, является успехом и сохраняется. Каждый результат, который не
							равен этому, считается неудачей и сбрасывается. Каждый результат 6 всегда является критическим успехом. Каждый другой успех является обычным успехом. Каждый результат 1
							всегда является неудачей.
						</p>
						<p>Если целевой оперативник заслонённый:</p>
						<ul>
							<li>Атакующий должен сбросить один успех по своему выбору вместо того, чтобы сохранить его.</li>
							<li>Все критические успехи атакующего сохраняются как обычные успехи и не могут быть изменены на критические успехи (это имеет приоритет над всеми другими правилами).</li>
						</ul>
						<p>
							Оперативник является заслонённым, если между оперативниками есть тяжёлый террейн. Однако он не может быть заслонённым тяжёлым террейном, который находится в пределах 1" от
							любого из оперативников.
						</p>
						<AppHeading :level="5" subtitle="roll defence dice" class="mt-7">4. Бросок защитных кубиков</AppHeading>
						<p>
							Защищающийся собирает три защитных кубика. Если целевой оперативник находится в укрытии, он может сохранить один обычный успех без броска — это называется спасбросок от
							укрытия. Оставшиеся кубики он бросает.
						</p>
						<p>
							Каждый результат, равный или превышающий характеристику Save цели, является успехом и сохраняется. Каждый результат, который не равен этому, считается неудачей и
							сбрасывается. Каждый результат 6 всегда является критическим успехом. Каждый другой успех является обычным успехом. Каждый результат 1 всегда является неудачей.
						</p>

						<AppHeading :level="5" subtitle="resolve defence dice" class="mt-7">5. Распределение защитных кубиков </AppHeading>
						<p>Защищающийся распределяет все свои успешные защитные кубики, чтобы заблокировать успешные атакующие кубики.</p>
						<ul>
							<li>Один обычный успех может заблокировать один обычный успех.</li>
							<li>Два обычных успеха могут заблокировать один критический успех.</li>
							<li>Один критический успех может заблокировать один обычный успех или один критический успех.</li>
						</ul>
						<AppHeading :level="5" subtitle="resolve range attack dice" class="mt-7">6. Распределение атакующих кубиков </AppHeading>

						<p>Все успешные незаблокированные атакующие кубики наносят урон целевому оперативнику.</p>
						<ul>
							<li>Обычный успех наносит урон, равный характеристике Normal Dmg оружия.</li>
							<li>Критический успех наносит урон, равный характеристике Critical Dmg оружия.</li>
						</ul>
						<p>Все оперативники, которые были выведены из строя (см. урон на стр. 47), удаляются после того, как активный оперативник полностью завершил это действие.</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							В отличие от стрельбы, драка — это жестокая дуэль с постоянными ответными атаками. Внимательно выбирайте, с кем вступать в драку, так как противник будет выполнять ответную
							атаку.
						</AppBlockquote>
						<AppBlockquote>
							Если в правилах сказано, что оперативник не может наносить ответные удары, то по нему всё равно можно вести бой, но он не может собирать или разыгрывать кубики атаки.
						</AppBlockquote>
					</template>

					<template #right>
						<ActionCard
							title="Драка"
							subtitle="Fight"
							:ap="1"
							:effects="[
								'<p>Выполните драку активным оперативником, следуя последовательности ниже. Игрок активного оперативника является атакующим. Игрок выбранного вражеского оперативника является защищающимся.</p>',
							]"
							:conditions="['<p>Оперативник не может выполнить это действие, если в радиусе его контроля нет вражеского оперативника.</p>']"
						/>

						<AppHeading :level="5" subtitle="select enemy operative">1. Выбор вражеского оперативника</AppHeading>
						<p>
							Атакующий выбирает вражеского оперативника в радиусе контроля активного оперативника, с которым будет драться. Этот вражеский оперативник будет выполнять ответную атаку в
							этом действии.
						</p>
						<AppBlockquote>
							Важно различать, когда оперативник дерётся и когда он выполняет ответную атаку. Оперативник, который дерётся, — это активный оперативник, тогда как оперативник, выполняющий
							ответную атаку, — это выбранный вражеский оперативник.
						</AppBlockquote>
						<AppHeading :level="5" subtitle="select weapons">2. Выбор оружия</AppHeading>
						<p>
							Оба игрока выбирают по одному оружию ближнего боя, которое есть у их оперативника, и собирают их атакующие кубики — количество D6, равное характеристике Atk этого оружия.
						</p>
						<AppHeading :level="5" subtitle="roll melee attack dice">3. Бросок атакующих кубиков</AppHeading>
						<p>
							Оба игрока одновременно бросают свои атакующие кубики. Каждый результат, равный или превышающий характеристику Hit выбранного оружия, является успехом и сохраняется. Каждый
							результат, который не равен этому, считается неудачей и сбрасывается. Каждый результат 6 всегда является критическим успехом. Каждый другой успех является обычным успехом.
							Каждый результат 1 всегда является неудачей.
						</p>
						<p>
							Если дружественному оперативнику помогают другие дружественные оперативники, улучшите характеристику Hit его оружия ближнего боя на 1 за каждого такого помощника. Чтобы
							дружественный оперативник мог помогать, он должен находиться в радиусе контроля вражеского оперативника, участвующего в этой драке, и не находиться в радиусе контроля
							другого вражеского оперативника.
						</p>
						<AppBlockquote>
							Если правило указывает, что оперативник не может отвечать, его всё равно можно атаковать, но для него нельзя собирать или разрешать кубики атаки.
						</AppBlockquote>
						<AppBlockquote>
							Наличие нескольких дружественных оперативников в радиусе контроля вражеского оперативника не позволяет всем им драться одновременно, но наличие помощников делает успешные
							атакующие кубики более вероятными.
						</AppBlockquote>
						<AppHeading :level="5" subtitle="resolve melee attack dice">4. Распределение атакующих кубиков</AppHeading>
						<p>
							Начиная с атакующего, игроки по очереди распределяют по одному своему успешному незаблокированному атакующему кубику. Игроки повторяют этот процесс, пока один из игроков не
							распределит все свои кубики (в этом случае его оппонент распределяет все оставшиеся кубики), либо пока один из оперативников в этой драке не будет выведен из строя (см.
							урон на стр. 47). Когда игрок распределяет кубик, он должен либо нанести удар, либо заблокировать.
						</p>
						<p>Если он наносит удар, он наносит урон вражескому оперативнику, затем сбрасывает этот кубик.</p>
						<ul>
							<li>Обычный успех наносит урон, равный характеристике Normal Dmg оружия.</li>
							<li>Критический успех наносит урон, равный характеристике Critical Dmg оружия.</li>
						</ul>
						<p>Если он блокирует, он может распределить этот кубик, чтобы заблокировать один из нераспределённых успехов оппонента.</p>
						<ul>
							<li>Обычный успех может заблокировать один обычный успех.</li>
							<li>Критический успех может заблокировать один обычный успех или один критический успех.</li>
						</ul>
						<AppBlockquote> Нанесение удара сразу наносит урон, поэтому это может быть эффективным способом повреждения врагов. </AppBlockquote>
						<AppBlockquote> Блокирование не останавливает удар, когда он происходит, оно останавливает успех, который ещё предстоит распределить. </AppBlockquote>
						<AppBlockquote>
							Вы всё равно можете блокировать, даже если у вашего оппонента не осталось нераспределённых успехов. Это полезно, если вы пока не хотите выводить вражеского оперативника из
							строя.
						</AppBlockquote>
					</template>
				</TwoColumnLayout>

				<!-- ДЕЙСТВИЯ /-->

				<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

				<!--  -->

				<AppHeading :level="2" subtitle="Key Principles">Ключевые принципы</AppHeading>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							По мере того как вы будете играть свои первые партии, вы получите лучшее понимание применения ключевых принципов и сможете просто возвращаться к ним при необходимости.
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Bases">Базы</AppHeading>
						<p>Все оперативники находятся на базах.</p>
						<ul>
							<p>База — важная часть миниатюры с точки зрения правил, особенно для измерения дистанций.</p>
							<li>Размер базы каждого оперативника указан в его датакарте.</li>
							<li>Стороны разных баз могут касаться друг друга, но одну базу нельзя ставить на другую.</li>
							<li>Дружественные оперативники могут перемещаться сквозь других дружественных оперативников (базу и миниатюру), но не сквозь вражеских оперативников.</li>
							<li>Базы не могут перемещаться сквозь террейн или находиться за краем киллзоны.</li>
						</ul>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote> Представляйте радиус контроля как область взаимодействия оперативника с тем, что находится рядом с ним. </AppBlockquote>
					</template>

					<template #right>
						<AppHeading :level="3" subtitle="Control Range">Радиус контроля</AppHeading>
						<p>
							Многие правила относятся к радиусу контроля, такие как перемещение, драка и использование укрытия. Что-либо находится в радиусе контроля оперативника, если оно видимо для
							этого оперативника и находится в пределах 1" от него.
						</p>
						<p>
							Радиус контроля между оперативниками является взаимным, поэтому оперативники находятся в радиусе контроля друг друга, если один из них видим для другого и находится в
							пределах 1" от него.
						</p>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/control_range.jpg" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Оперативники A и B находятся в радиусе контроля друг друга.</p>
								<p>Террейн находится в радиусе контроля как оперативника B, так и оперативника C.</p>
								<p>Из-за террейна оперативник B не видим для оперативника C и наоборот, поэтому они не находятся в радиусе контроля друг друга.</p>
							</figcaption>
						</figure>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Оперативник в укрытии со Скрытым приказом не является допустимой целью. Оперативник в укрытии с Боевым приказом является допустимой целью, но получает спасбросок от укрытия
							(см. действие <a href="#shoot" class="text-primary">«Стрельба»</a>).
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Cover">Укрытие</AppHeading>
						<p>
							Укрытие определяется от одного оперативника к другому, обычно когда один из них выполняет стрельбу. Оперативник находится в укрытии, если есть террейн, находящийся на линии
							огня, в пределах его радиуса контроля. Однако он не может находиться в укрытии, если находится в пределах 2" от другого оперативника. Термин «линия огня» объясняется на
							стр. 51.
						</p>

						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0S">
								<NuxtPicture src="/images/core-rules/cover_1.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Террейн, находящийся на линии огня, находится в радиусе контроля оперативника A, следовательно, он находится в укрытии.</p>
							</figcaption>
						</figure>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/cover_2.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Есть террейн, находящийся на линии огня, но он не находится в радиусе контроля оперативника A, следовательно, он не находится в укрытии.</p>
							</figcaption>
						</figure>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/cover_3.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Есть террейн в радиусе контроля оперативника A, но этот террейн не находится на линии огня, следовательно, он не находится в укрытии.</p>
							</figcaption>
						</figure>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/cover_2.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>
									Есть террейн, находящийся на линии огня, в радиусе контроля оперативника A, но оперативник B находится в пределах 2" от оперативника A, следовательно, он не
									находится в укрытии.
								</p>
							</figcaption>
						</figure>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>Отслеживайте оставшиеся раны каждого оперативника с помощью кубиков, токенов или записывая их. </AppBlockquote>
						<AppBlockquote>
							«Выведен из строя» и «удалён из киллзоны» — это разные состояния. Некоторые правила вступают в силу, когда оперативник выведен из строя, но до того, как он будет удалён.
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Damage">Урон</AppHeading>

						<p>
							Когда оперативнику наносится урон, уменьшите его раны на это значение. Начальное количество ран оперативника определяется его характеристикой Wounds (см. датакарты на стр.
							48). Если раны оперативника уменьшены до 0 или ниже, он выведен из строя, затем удаляется из киллзоны.
						</p>

						<p>
							Некоторые правила позволяют выведенному из строя оперативнику выполнить бесплатное действие до того, как он будет удалён из киллзоны. В этом случае такой оперативник не
							может выполнить более одного бесплатного действия (за исключением Разместить маркер), и игрок этого оперативника определяет порядок применения любых его правил, которые
							происходят до удаления из киллзоны (это имеет приоритет над тем, что игрок с инициативой принимает решение).
						</p>

						<p>
							Пока у оперативника остаётся меньше ран, чем начальное значение, он ранен. Когда у него осталось меньше половины начального количества ран, он считается тяжело раненым.
							Вычтите 2" из характеристики Передвижения тяжело раненых оперативников и ухудшите характеристику Hit их оружия на 1.
						</p>
						<AppHeading :level="4" subtitle="Injured">Тяжёлое ранение</AppHeading>
						<p><strong>У тяжело раненых оперативников уменьшите характеристику «Движение» на 2 дюйма и ухудшите характеристику «Попадание» их оружия на 1.</strong></p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote> Если оперативник имеет APL 2, и два правила говорят добавить +1 к APL оперативника, его APL будет равен 3. </AppBlockquote>
						<AppBlockquote>
							Если характеристики оперативника или характеристики его оружия изменяются во время действия, примените изменение после завершения этого действия. Обратите внимание, что
							изменения правил оружия применяются немедленно.
						</AppBlockquote>
						<AppBlockquote>
							Обратите внимание, что более высокое числовое значение характеристики Hit и Save является худшим, так как вероятность выбросить успех уменьшается. Это важно, если правило
							требует улучшить или ухудшить такую характеристику. Например, Hit 4+, ухудшенный на 1, становится 5+.
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Datacards">Карточки данных</AppHeading>
						<div class="w-full shrink-0 flex justify-center">
							<NuxtPicture src="/images/core-rules/example_datacard.jpg" format="webp" class="block mx-auto h-auto" />
						</div>

						<AppHeading :level="4" subtitle="Type of operative">1. Тип оперативника.</AppHeading>
						<AppHeading :level="4" subtitle="Operative stats">2. Характеристики оперативника:</AppHeading>
						<ul>
							<li>
								<strong>Предел очков действия (APL): </strong> Общая стоимость действий, которые оперативник может выполнить за свою активацию, а также характеристика, используемая для
								определения контроля маркеров. Некоторые редкие правила изменяют APL оперативника. Независимо от того, на сколько меняется характеристика APL оперативника под
								воздействием правил, итоговое значение никогда не может быть больше или меньше более чем на 1 от его обычного APL. Это имеет приоритет над всеми изменениями
								характеристик.
							</li>
							<li>
								<strong>Передвижение (MOVE): </strong> Дистанция передвижения оперативника, используемая при выполнении действий Репозиционирование, Отступление и Наскок.
								Характеристика Передвижения оперативника никогда не может быть изменена на значение меньше 4". Это имеет приоритет над всеми изменениями характеристик.
							</li>
							<li><strong>Спасбросок (SAVE): </strong>Результат, необходимый для успешного защитного кубика каждый раз, когда другой оперативник выполняет по нему стрельбу.</li>
							<li><strong>Раны (WOUNDS): </strong>Начальное количество ран оперативника, которое уменьшается по мере нанесения ему урона.</li>
						</ul>
						<AppHeading :level="4" subtitle="Weapon stats">3. Характеристики оружия:</AppHeading>
						<p>Страницы выбора килл тима в его правилах указывают, каким оружием обладает оперативник. Если не указано иное, оперативник имеет всё оружие, указанное на его датакарте.</p>
						<ul>
							<li>
								<p>
									<strong>Тип оружия: </strong>дальнобойное оружие, используется, когда оперативник выполняет стрельбу; оружие ближнего боя, используется, когда оперативник дерётся
									или выполняет ответную атаку.
								</p>
							</li>
							<li>
								<p><strong>Атаки (ATK): </strong> Количество атакующих кубиков, которые бросаются каждый раз, когда оперативник использует это оружие.</p>
							</li>
							<li>
								<p><strong>Попадание (HIT):</strong> Результат, необходимый для успешного атакующего кубика каждый раз, когда оперативник использует это оружие.</p>
							</li>
							<li>
								<p>
									<strong>Урон (DMG):</strong> Урон, который наносят атакующие кубики этим оружием. Первое значение — Normal Dmg (урон от обычного успеха), второе значение — Critical
									Dmg (урон от критического успеха).
								</p>
							</li>
							<li>
								<p>
									Иногда разные виды оружия имеют одно и то же основное название, но разные вторичные названия, указанные в скобках, например: «plasma gun (standard)» и «plasma gun
									(supercharge)». Это фактически разные профили одного и того же оружия, но используемые как отдельные виды оружия. Если правило ссылается только на основное
									название, оно включает всё оружие с этим основным названием.
								</p>
							</li>
						</ul>
						<AppHeading :level="4" subtitle="Weapon rules">4. Правила оружия:</AppHeading>
						<ul>
							<li>Дополнительные правила, которые применяются каждый раз, когда оперативник использует это оружие; описаны на стр. 111.</li>
						</ul>
						<AppHeading :level="4" subtitle="Additional rules">5. Дополнительные правила:</AppHeading>
						<ul>
							<li>Дополнительные правила, которыми обладает оперативник.</li>
							<li>Уникальные действия, которые может выполнять оперативник. Действия описаны на стр. 40.</li>
						</ul>
						<AppHeading :level="4" subtitle="Keywords">6. Ключевые слова:</AppHeading>
						<ul>
							<li>Используются для идентификации оперативника для правил — некоторые правила будут влиять только на оперативников с соответствующими ключевыми словами.</li>
							<li>Отображаются <strong>ЖИРНЫМ ШРИФТОМ</strong>.</li>
							<li>
								Ключевые слова оранжевого цвета с символом черепа, например
								<span class="text-orange-500 font-bold">TEMPESTUS AQUILON <Icon name="mdi:skull" class="align-middle" /> </span>, являются ключевыми словами фракции — они используются
								для идентификации всех оперативников этого килл тима.
							</li>
						</ul>
						<AppHeading :level="4" subtitle="Base size in mm">7. Размер базы в мм.</AppHeading>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Например, если требуется 4+, результат броска кубика 4, 5 или 6 удовлетворяет этому требованию; а если требуется 1–4, результат броска 1, 2, 3 или 4 удовлетворяет этому
							требованию.
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Dice">Кубики</AppHeading>
						<p>
							Используйте шестигранные кубики (D6, D3) для определения результата различных правил. Часто это требует значения x+, где x — минимально возможный результат, например 3+.
							Иногда требуется результат в диапазоне, например 1–3. Некоторые правила требуют бросить D3. Для этого бросьте один D6 и разделите результат пополам (округляя вверх).
							Некоторые правила требуют xD6 или xD3 (например, 2D6 или 3D3). Бросьте соответствующее количество кубиков и сложите результаты. Некоторые правила требуют D6+x или D3+x
							(например, D6+2 или D3+3). Бросьте указанный кубик и прибавьте x к результату.
						</p>
						<p>
							Некоторые правила позволяют выполнить переброс броска кубика. Вы никогда не можете перебрасывать один и тот же бросок кубика более одного раза, и вы не можете выбрать
							исходный результат, даже если новый результат хуже. Если это атакующий или защитный кубик, переброс выполняется до того, как он будет сохранён или сброшен. Если вы можете
							перебрасывать несколько разных кубиков, вы можете делать это в любом порядке, включая просмотр результата одного переброса перед тем, как решить, делать ли следующий. Если
							несколько игроков могут перебрасывать кубики одновременно (например, во время действия Драка), они по очереди либо перебрасывают кубик, либо пасуют, начиная с игрока с
							инициативой (это имеет приоритет над инициативой и правилами, которые происходят в одно и то же время; см. стр. 37).
						</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Оперативники, находящиеся в определённой дистанции от оперативника, который переносит маркер, также находятся в той же дистанции от этого маркера.
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Distances">Дистанции</AppHeading>
						<p>
							Различные правила имеют требования по дистанции в дюймах. При измерении до и от чего-либо измеряйте от ближайшей части этого объекта. Для оперативника измеряйте от его
							базы, игнорируя все части его миниатюры. При измерении до и от области киллзоны измеряйте только горизонтальную дистанцию (другими словами, смотрите сверху, чтобы
							игнорировать вертикальную дистанцию).
						</p>
						<p>
							Если правило требует, чтобы что-либо находилось «в пределах» дистанции, требование выполняется, если любая часть этого объекта находится на этой дистанции или ближе. Если
							правило требует, чтобы что-либо находилось «полностью в пределах» дистанции, требование выполняется, если каждая часть этого объекта находится на этой дистанции или ближе.
							Оперативник всегда находится в пределах и полностью в пределах дистанций по отношению к самому себе и к маркеру, который он переносит. Если оперативник несёт маркер миссии
							или цели, этот маркер находится на той же дистанции, что и этот оперативник.
						</p>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/distances.jpg" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>
									Оперативник <strong>B</strong> находится в пределах 2" от оперативника <strong>A</strong>. Маркер цели находится в пределах 2" от оперативника <strong>A</strong>.
									Оперативник <strong>C</strong> полностью находится в пределах 2" от оперативника <strong>A</strong>.
								</p>
							</figcaption>
						</figure>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #right>
						<AppHeading :level="3" subtitle="Equipment">Снаряжение</AppHeading>
						<p>Снаряжение — это дополнительные правила, которые вы можете выбрать перед боем, как указано в последовательности вашей игры (например, стр. 110)</p>
						<p>Универсальное снаряжение доступно для любой ударной команды, тогда как фракционное снаряжение специфично для определённой фракции.</p>
						<p>Каждый игрок не может выбрать одну и ту же опцию снаряжения более одного раза за игру.</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Игрок оперативника решает, из какой точки базы проводятся линии наведения. Это может позволить оперативнику получить более выгодный угол наведения — представьте, что
							оперативник наклоняется вправо или влево по необходимости.
						</AppBlockquote>
						<AppBlockquote>
							Обычно «находится на линии огня» определяется от одного оперативника к другому, но некоторые редкие правила потребуют определить это от других объектов, например маркеров.
							В таких случаях считайте все части этого объекта его «базой» при определении этого.
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Intervening">Линия огня</AppHeading>
						<p>
							Правила, такие как укрытие и заслонение, требуют определить, находится ли что-то на линии огня, например террейн. В большинстве случаев это легко определить — если объект
							находится между оперативником и предполагаемой целью, он находится на линии огня. Иногда это может быть неочевидно, поэтому используются линии наведения.
						</p>
						<p>
							Чтобы использовать линии наведения, игрок оперативника проводит воображаемые прямые линии диаметром 1 мм от любой точки его базы к каждой видимой части базы предполагаемой
							цели. Всё, что пересекает хотя бы одна из этих линий, находится на линии огня. Всё, что пересекают все эти линии, полностью находится на линии огня.
						</p>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0S">
								<NuxtPicture src="/images/core-rules/intervening_1.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Линии наведения пересекают террейн, следовательно, он находится на линии огня.</p>
							</figcaption>
						</figure>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0S">
								<NuxtPicture src="/images/core-rules/intervening_2.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Из-за того, откуда игрок оперативника A решил провести линии наведения, террейн не находится на линии огня.</p>
							</figcaption>
						</figure>
						<p>
							Чаще всего линии наведения можно проводить в двухмерном виде (сверху вниз) для удобства. Однако если есть разница по высоте между оперативниками (например, один из них
							находится на выгодном террейне), линии наведения следует проводить в трёхмерном виде.
						</p>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0S">
								<NuxtPicture src="/images/core-rules/intervening_3.jpg" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Ни одна из этих линий наведения не пересекает элемент террейна A, следовательно, он не находится на линии огня.</p>
							</figcaption>
						</figure>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #right>
						<AppHeading :level="3" subtitle="Keywords">Ключевые слова</AppHeading>

						<p>
							Ключевые слова — это способ идентификации для некоторых правил. Чаще всего вы будете использовать ключевые слова для оперативников (см. датакарты на стр. 48) — некоторые
							правила будут влиять только на оперативников с соответствующими ключевыми словами.
						</p>
						<p>
							Некоторые редкие правила также имеют ключевые слова, например <strong>SUPPORT</strong> или <strong>STRATEGIC GAMBIT</strong>. Эти ключевые слова сами по себе ничего не
							значат, но другие правила взаимодействуют с ними. Ключевые слова отображаются <strong>ЖИРНЫМ ШРИФТОМ КЛЮЧЕВЫХ СЛОВ</strong>. Ключевые слова оранжевого цвета с символом
							черепа, например <span class="text-orange-500 font-bold">TEMPESTUS AQUILON <Icon name="mdi:skull" class="align-middle" /> </span>, являются ключевыми словами фракции — они
							используются для идентификации всех оперативников/правил этого килл тима.
						</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #right>
						<AppHeading :level="3" subtitle="Killzone Floor">Поверхность киллзоны</AppHeading>
						<p>
							Поверхность киллзоны — это самый нижний уровень киллзоны (т. е. игровое поле). Всё, что находится на маркере, который расположен на поверхности киллзоны, также находится на
							поверхности киллзоны.
						</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							<figure class="m-0 flex flex-col items-center justify-center">
								<div class="w-full shrink-0S">
									<NuxtPicture src="/images/core-rules/kt__0001_objective_marker_example.png" format="webp" class="w-full h-auto" />
								</div>
								<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
									<p>Маркеры целей — самый распространённый тип маркеров, представляющий важные точки в киллзоне. Контроль над ними часто требуется для достижения победы.</p>
								</figcaption>
							</figure>
						</AppBlockquote>
						<AppBlockquote>
							<figure class="m-0 flex flex-col items-center justify-center">
								<div class="w-full shrink-0S">
									<NuxtPicture src="/images/core-rules/kt__0000_represent_a_marker.png" format="webp" class="w-full h-auto" />
								</div>
								<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
									<p>
										Допустимо использовать миниатюру для обозначения маркера, но держите под рукой обычный маркер на случай, если это создаст проблемы с правилами (например, если
										миниатюра слишком большая).
									</p>
								</figcaption>
							</figure>
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Markers">Маркеры</AppHeading>
						<p>
							Маркеры размещаются в точных местах (это должно быть место, в котором их можно разместить) и влияют на игру и оперативников вокруг них. Они могут быть размещены под
							оперативниками (временно уберите оперативников, чтобы сделать это), и оперативники могут быть размещены поверх них. Маркеры целей имеют диаметр 40 мм. Все остальные маркеры
							имеют диаметр 20 мм. Некоторые маркеры известны как маркеры миссии. Это само по себе ничего не означает, но другие правила взаимодействуют с этим.
						</p>
						<p>
							Оперативники оспаривают маркеры в пределах своего радиуса контроля. Дружественные оперативники контролируют маркер, если суммарный APL этих оспаривающих оперативников
							больше, чем у вражеских оперативников, но контроль не может изменяться во время действия. Пока оперативник переносит маркер (см. действие Поднять маркер на стр. 41), он
							оспаривает и контролирует этот маркер и является единственным оперативником, который может это делать.
						</p>

						<figure class="m-0 flex flex-col items-center justify-center">
							<div class="w-full shrink-0S">
								<NuxtPicture src="/images/core-rules/marker_place_example.jpg" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-0 flex-1">
								<p>
									В приведённом выше примере только три оперативника оспаривают маркер цели, так как он не находится в радиусе контроля оранжевого оперативника слева (элемент
									террейна мешает видимости). Суммарный APL оранжевых оперативников, оспаривающих маркер цели, равен 2. Суммарный APL белых оперативников, оспаривающих его, равен 4,
									поэтому они его контролируют.
								</p>
							</figcaption>
						</figure>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<div class="flex flex-col justify-between h-full">
							<AppBlockquote>
								Заслонённый — это ситуация, когда оперативник является допустимой целью, но находящиеся на линии огня препятствия (обычно террейн) делают его менее эффективной целью.
								Представьте, что оперативник вынужден целиться во врага через руины или далёкое окно.
							</AppBlockquote>
							<AppBlockquote>
								Иными словами, нахождение оперативника в пределах 1" от элемента террейна не предотвращает заслонение всего элемента террейна — только той его части, которая находится
								в пределах 1" от оперативника.
							</AppBlockquote>
						</div>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Obscured">Заслонение</AppHeading>
						<p>
							Заслонение определяется от одного оперативника к другому, обычно когда один из них выполняет стрельбу. Оперативник является заслонённым, если есть тяжёлый террейн,
							находящийся на линии огня. Однако он не может быть заслонён тяжёлым террейном, который находится в пределах 1" от любого из оперативников. Термин «линия огня» объясняется
							на стр. 51.
						</p>
						<ul>
							<p>Когда оперативник выполняет стрельбу, если целевой оперативник заслонён:</p>
							<li>Атакующий должен сбросить один успех по своему выбору вместо того, чтобы сохранить его.</li>
							<li>Все критические успехи атакующего сохраняются как обычные успехи и не могут быть изменены на критические успехи (это имеет приоритет над всеми другими правилами).</li>
						</ul>

						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/obscured_1.jpg" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>
									Оперативник <strong>B</strong> виден для оперативника <strong>A</strong> через окно. Однако есть тяжёлый террейн, находящийся на линии огня, более чем в 1" от обоих
									оперативников, следовательно, оперативник <strong>B</strong> является заслонённым.
								</p>
							</figcaption>
						</figure>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/obscured_2.jpg" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>
									Есть тяжёлый террейн, находящийся на линии огня, но он находится в пределах 1" от оперативника
									<strong>A</strong>, следовательно, оперативник <strong>B</strong> не является заслонённым.
								</p>
							</figcaption>
						</figure>
						<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/obscured_3.jpg" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>
									Есть тяжёлый террейн, находящийся на линии огня. Хотя части этого террейна находятся в пределах 1" от оперативников, часть — нет, следовательно, оперативник
									<strong>B</strong> является заслонённым.
								</p>
							</figcaption>
						</figure>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #right>
						<AppHeading :level="3" subtitle="Operatives">Оперативники</AppHeading>
						<p>Оперативники — это миниатюры Citadel, используемые в игре.</p>
						<p>Ваши оперативники являются дружественными оперативниками, а оперативники вашего оппонента — вражескими оперативниками.</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #right>
						<AppHeading :level="3" subtitle="Orders">Приказы</AppHeading>

						<div class="flex md:flex-row flex-col pag-4">
							<figure class="m-0 p-0 h-fit flex flex-row items-center justify-center gap-8 flex-1">
								<div class="shrink-0 w-full max-w-32">
									<NuxtPicture src="/images/core-rules/engage_token.png" format="webp" class="w-full h-auto" />
								</div>
								<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
									<p><strong>Боевой приказ:</strong> Оперативник может выполнять действия как обычно и может противодействовать.</p>
								</figcaption>
							</figure>
							<figure class="m-0 p-0 h-fit flex flex-row items-center justify-center gap-8 flex-1">
								<div class="shrink-0 w-full max-w-32">
									<NuxtPicture src="/images/core-rules/conceal_token.png" format="webp" class="w-full h-auto" />
								</div>
								<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
									<p>
										<strong>Скрытый приказ:</strong> Оперативник не может выполнять действия Выстрел и Наскок, а также не может противодействовать. Однако он не является допустимой
										целью, пока находится в укрытии.
									</p>
								</figcaption>
							</figure>
						</div>
						<p>Оперативники получают Скрытый приказ при расстановке перед боем. Вы можете изменить приказ оперативника каждый раз, когда он активируется.</p>
						<p>
							Токены приказов имеют две стороны. Светлая сторона показывает, что оперативник готовый (он может быть активирован в Боевой фазе), а тёмная сторона показывает, что
							оперативник истощенный (он уже был активирован в Боевой фазе).
						</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #right>
						<AppHeading :level="3" subtitle="Ploys">Приёмы</AppHeading>
						<p>Игроки могут тратить КО (CP) на приёмы, чтобы получать бонусы правил в подходящий момент. Если не указано иное, все приёмы стоят 1 КО. Существует два типа приёмов:</p>
						<ul>
							<li>
								Каждый стратегический приём — это <strong>СТРАТЕГИЧЕСКИЙ ГАМБИТ</strong> (используется на шаге Гамбит в Стратегической фазе). Некоторые правила приёмов распределяются
								немедленно, другие применяют правила, которые действуют до конца переломного момента.
							</li>
							<li>Боевые приёмы используются в Боевой фазе и применяют правила так, как указано в описании приёма.</li>
						</ul>
						<p>
							Все игроки имеют доступ к боевому приёму Командный переброс, указанному ниже, а также к приёмам в правилах их килл тима. За исключением Командного переброса, каждый игрок
							не может использовать каждый приём более одного раза за переломный момент.
						</p>
						<ActionCard
							title="Командный переброс"
							subtitle="Command re-roll"
							:level="4"
							:ap="1"
							:effects="['<p>Используйте этот боевой приём после броска ваших атакующих или защитных кубиков. Вы можете выполнить переброс одного из этих кубиков.</p>']"
						/>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Если правило на карточке данных говорит: «этот оперативник может выполнить два действия Выстрел во время своей активации», это имеет приоритет над основными правилами
							ограничений действий (стр. 39), в соответствии с приоритетом №3.
						</AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Precedence">Приоритет</AppHeading>
						<p>Некоторые редкие правила могут противоречить друг другу, поэтому необходимо определить, какое из них имеет приоритет.</p>
						<p>В порядке приоритета правило имеет преимущество, если:</p>
						<ol>
							<li>В нём прямо указано, что оно имеет приоритет.</li>
							<li>В онлайн-комментариях дизайнера указано, что оно имеет приоритет.</li>
							<li>Оно не содержится в основной книге правил (т.е. другие правила имеют приоритет над правилами основной книги).</li>
							<li>В нём сказано «нельзя».</li>
							<li>Контролирующий игрок активного оперативника решает.</li>
							<li>Игрок с инициативой решает.</li>
						</ol>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #right>
						<AppHeading :level="3" subtitle="Roll-off">Жеребьёвка</AppHeading>
						<p>Если правило требует жеребьёвки, оба игрока бросают по одному D6, и тот, у кого результат выше, выигрывает жеребьёвку.</p>
						<p>При ничьей, жеребьёвка проводится снова.</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote> Токены приказов — самый распространённый тип токенов, показывающий приказ оперативника и готов он или истощён. </AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Tokens">Токены</AppHeading>

						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/tokens_set.jpg" format="webp" class="w-full h-auto" />
						</div>

						<p>
							Токены используются, чтобы помочь отслеживать эффекты правил. Их часто размещают рядом с соответствующим оперативником, но при необходимости их можно перемещать, чтобы
							освободить место для других оперативников и маркеров. Токены убираются, когда отслеживаемый эффект правила заканчивается.
						</p>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote>
							Скрытый приказ имитирует оперативника, который максимально использует доступное укрытие, поэтому даже если он полностью видим, мы представляем, что он пригибается за
							находящимся на линии огня террейном в пределах своего радиуса контроля, чтобы избежать статуса допустимой цели.
						</AppBlockquote>
					</template>

					<template #right>
						<AppHeading :level="3" subtitle="Valid Target">Допустимая цель</AppHeading>

						<p>
							Некоторые правила требуют, чтобы вы выбрали допустимую цель для оперативника. Чаще всего это происходит, когда оперативник выполняет выстрел, но иногда это требуется и
							другими редкими правилами.
						</p>

						<div class="flex md:flex-row flex-col pag-4">
							<figure class="m-0 p-0 h-fit flex flex-row items-center justify-center gap-8 flex-1">
								<div class="shrink-0 w-full max-w-32">
									<NuxtPicture src="/images/core-rules/engage_token.png" format="webp" class="w-full h-auto" />
								</div>
								<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
									<p>Если предполагаемая цель находится в Боевом приказе, она является допустимой целью, если видима для оперативника.</p>
								</figcaption>
							</figure>
							<figure class="m-0 p-0 h-fit flex flex-row items-center justify-center gap-8 flex-1">
								<div class="shrink-0 w-full max-w-32">
									<NuxtPicture src="/images/core-rules/conceal_token.png" format="webp" class="w-full h-auto" />
								</div>
								<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
									<p>Если предполагаемая цель находится в Скрытом приказе, она является допустимой целью, если видима для оперативника и не находится в укрытии.</p>
								</figcaption>
							</figure>
						</div>
					</template>
				</TwoColumnLayout>

				<TwoColumnLayout>
					<template #left>
						<AppBlockquote> Вражеский оперативник видим на обоих изображениях, даже если он частично находится за близлежащими руинами. </AppBlockquote>
					</template>
					<template #right>
						<AppHeading :level="3" subtitle="Visible">Видимость</AppHeading>

						<p>
							Чтобы что-то было видимым, оперативник должен иметь возможность это видеть. Для проверки видимости посмотрите из-за оперативника и определите, можете ли вы провести
							беспрепятственную прямую линию диаметром 1 мм от головы оперативника к любой части того, что он пытается увидеть. Игнорируйте базы оперативников при этом определении.
							Оперативник всегда видим сам для себя. Вражеский оперативник видим на обоих изображениях ниже, даже когда он частично находится за ближайшими руинами.
						</p>

						<div class="flex flex-col md:flex-row gap-4">
							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/visible_1.jpg" format="webp" class="block mx-auto h-auto not-prose" />
							</div>

							<div class="w-full lg:w-1/2 shrink-0">
								<NuxtPicture src="/images/core-rules/visible_2.jpg" format="webp" class="block mx-auto h-auto not-prose" />
							</div>
						</div>
					</template>
				</TwoColumnLayout>

				<!--  -->

				<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

				<!--  -->

				<AppHeading :level="2" subtitle="Killzones">Киллзоны</AppHeading>
			</p>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>
						Если вы новичок в Kill Team, выберите одну киллзону, с которой начнёте. Затем, по мере накопления опыта, вы вскоре сможете в полной мере оценить разнообразный игровой процесс,
						который предлагают разные киллзоны.
					</AppBlockquote>
				</template>
				<template #right>
					<p>
						Киллзоны обеспечивают захватывающий и тактически насыщенный опыт поля боя для ваших оперативников. Существуют конкретные киллзоны (например, стр. 62–75) — просто используйте
						игровое поле и элементы террейна, которые включает киллзона. Вы также можете создать собственную киллзону из игровых полей и элементов террейна, имеющихся в вашей коллекции.
					</p>
					<p>Если не указано иное, игровое поле киллзоны имеет размер 30" × 22".</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>
						Оперативники должны завершать перемещение в локации, где их можно разместить — они не могут завершить его на середине взбирания, спуска или прыжка. Если это невозможно, они не
						могут начать перемещение.
					</AppBlockquote>
					<AppBlockquote> Помните, что отрезки округляются в большую сторону, поэтому если оперативник перемещается на 3,5", это считается как 4". </AppBlockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Terrain and Movement">Террейн и перемещение</AppHeading>
					<p>Оперативники не могут перемещаться сквозь террейн — они должны обходить его, взбираться на него или спускаться/прыгать с него.</p>
					<AppHeading :level="4" subtitle="Climbing">Взбирание</AppHeading>
					<p>
						Оперативник должен находиться в пределах 1" по горизонтали и 3" по вертикали от террейна, который находится в его видимости, чтобы взобраться на него. Каждое взбирание
						считается минимум как 2" по вертикали (например, дистанция в 1" считается как 2").
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/climbing.jpg" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Оперативник перемещается вверх на 4", пока не окажется выше самой высокой точки, на которую он должен взобраться. Он перемещается на 2", пока его база полностью не
								пройдёт парапет, затем он спускается на 0" (так как спуск меньше 2").
							</p>
						</figcaption>
					</figure>
					<AppHeading :level="4" subtitle="Dropping">Спуск</AppHeading>
					<p>
						Оперативники спускаются вниз, когда они сходят с террейна или после того как они прыгнули. Игнорируйте 2" вертикальной дистанции, на которую они спускаются во время каждого
						действия. Это означает, что вертикальный спуск на 2" или меньше игнорируется. Если они спускаются несколько раз в течение одного действия, игнорируется только суммарно 2", а не
						по 2" за каждый спуск.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/dropping.jpg" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Оперативник перемещается на 2" вперёд, пока полностью не сойдёт с края, затем спускается на 2" (общее расстояние 4", но первые 2" игнорируются). Оперативник также может
								прыгнуть с террейна, переместившись на 4" от одного края, прежде чем он спустится вниз.
							</p>
						</figcaption>
					</figure>
					<AppHeading :level="4" subtitle="Jumping">Прыжок</AppHeading>
					<p>
						Оперативники могут прыгать с выгодного террейна, находящегося выше чем на 2" от поверхности киллзоны, когда они сходят с него. Вы можете переместить их на расстояние до 4" по
						горизонтали от края, с которого они прыгают, выполняя это как любое другое перемещение, за исключением того, что оно совершается одним прямолинейным отрезком. Затем оперативник
						должен спуститься или взобраться оттуда. При прыжке с выгодного террейна, если на краю, с которого оперативник будет прыгать, есть элемент террейна, такой как парапет,
						оперативник должен сначала взобраться на него, а затем прыгать с самой высокой точки, через которую он обязан перелезть. При прыжке на элемент террейна вы можете игнорировать
						разницу высоты в 1" или меньше, включая его парапет (если он есть). Однако при прыжке с элемента террейна, если у него есть парапет, вы должны сначала взобраться на него.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/jumping.jpg" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Оперативник перемещается вверх на 2" (расстояние 1", но считается как минимальные 2"), пока не окажется выше самой высокой точки, на которую он должен взобраться. Затем
								он перемещается на 3", пока его база полностью не пройдёт элемент террейна, после чего он спускается на 0" (так как спуск меньше 2").
							</p>
						</figcaption>
					</figure>
					<AppBlockquote
						>Прыжок означает, что оперативники могут перемещаться через разрывы в террейне шириной до 4" и могут прыгать на расстояние до 4" через объекты, которые ниже их.</AppBlockquote
					>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>
						Всегда рассматривайте элементы террейна по частям, а не как один большой элемент террейна, в котором всё одинаково. Например, если правило говорит игнорировать Лёгкий террейн,
						игнорируйте только те части элемента террейна, которые являются Лёгким типом, а не весь элемент целиком.
					</AppBlockquote>
					<AppBlockquote>
						Хорошо иметь смесь Лёгкого и Тяжёлого террейна в вашей киллзоне, так как некоторые другие правила по-разному взаимодействуют с каждым из этих типов.
					</AppBlockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Terrain Types">Типы ландшафта</AppHeading>
					<p>
						Элемент террейна состоит из различных частей, каждая из которых является типом террейна (одна часть может иметь более одного типа). Если вы используете элемент террейна из
						определённой киллзоны, тип каждой части этого элемента террейна будет указан. Если вы используете элемент террейна из киллзоны собственной разработки, вы должны указать тип
						каждой части этого элемента террейна до начала битвы. Ниже приведены самые распространённые типы террейна, но у некоторых киллзон есть собственные типы.
					</p>
					<AppHeading :level="4" subtitle="Heavy">Тяжёлый</AppHeading>
					<p>Крупный террейн является Тяжёлым. Он может заслонять оперативников.</p>
					<div class="w-full lg:w-1/2 shrink-0">
						<NuxtPicture src="/images/core-rules/heavy_ter.jpg" format="webp" class="w-full h-auto not-prose" />
					</div>
					<AppHeading :level="4" subtitle="Light">Лёгкий</AppHeading>
					<p>Мелкий террейн является Лёгким. У него нет дополнительных правил, но другие правила взаимодействуют с ним по-разному (например, выгодный террейн на стр. 60).</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/light_ter.jpg" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Если вы хотите, маркеры цели также могут иметь Лёгкий террейн, используя эти миниатюры. База 40 мм всё ещё является маркером, но прикреплённый к ней террейн является
								Лёгким.
							</p>
						</figcaption>
					</figure>
					<AppHeading :level="4" subtitle="Blocking">Блокирующий</AppHeading>
					<p>
						Блокирующий террейн обычно относится к проёмам между элементами террейна или под ними. Видимость не может быть проведена через такие проёмы, и для целей укрытия и статуса
						«заслонённый» эти проёмы считаются находящимися на линии огня так же, как и окружающий их террейн.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/blocking_ter.jpg" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<ol>
								<li>Проём под этой трубой является Блокирующим террейном.</li>
								<li>Отверстие для обзора этой двери является Блокирующим террейном.</li>
								<li>Эта сломанная вентиляция является Блокирующим террейном.</li>
							</ol>
						</figcaption>
					</figure>
					<AppBlockquote>
						Технически Блокирующий террейн на самом деле не является физическим террейном, а представляет собой проёмы, через которые оперативники не должны иметь возможность видеть.
					</AppBlockquote>
					<AppBlockquote> Блокирующий террейн встречается редко, но он существует для необходимых случаев. </AppBlockquote>

					<!-- ВЫГОДНЫЙ -->
					<AppHeading :level="4" subtitle="Vantage">Выгодный</AppHeading>
					<p>
						Выгодный террейн — это верхние уровни киллзоны — области, на которые оперативники могут быть размещены над игровым полем. Если элемент террейна не является выгодным террейном,
						то оперативники могут перемещаться по нему, но не могут завершать на нём перемещение или быть размещены на нём. Выгодный террейн также является Лёгким террейном. Выгодный
						террейн имеет следующие основные особенности.
					</p>
					<p>
						Во-первых, каждый раз, когда оперативник на выгодном террейне выполняет выстрел по оперативнику, который получил в Боевой приказ, его дальнобойное оружие получает правило
						оружия Точный 1 (стр. 111), если целевой оперативник находится как минимум на 2" ниже него, или Точный 2, если целевой оперативник находится как минимум на 4" ниже него.
					</p>
					<p>
						Во-вторых, каждый раз, когда вы выбираете допустимую цель для оперативника на выгодном террейне, оперативники, находящиеся как минимум на 2" ниже этого оперативника и
						находящиеся в Скрытом приказе, не могут использовать Лёгкий террейн для укрытия. Хотя это может позволить таким оперативникам быть выбраны целью (при условии, что они находятся
						в видимости), это не снимает их спасбросок укрытия, и защитник может сохранить его как критический успех вместо этого, либо сохранить один дополнительный спасбросок укрытия.
					</p>
					<p>
						В-третьих, для целей определения статуса «заслонённый» игнорируйте Тяжёлый террейн, соединённый с выгодным террейном, на котором находится активный оперативник или
						предполагаемая цель.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/vantage_ter.jpg" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<ol>
								<li>Эти части обе являются выгодным террейном.</li>
								<li>
									Оперативник <strong>B</strong> находится в Скрытом приказе и в укрытии от Лёгкого террейна, поэтому обычно он не был бы допустимой целью для оперативника
									<strong>A</strong>. Однако, так как оперативник <strong>A</strong> находится на выгодном террейне и как минимум на 2" выше него, оперативник
									<strong>B</strong> является допустимой целью, но он получает улучшенный спасбросок укрытия.
								</li>
							</ol>
						</figcaption>
					</figure>
					<AppBlockquote>
						Так как выгодный террейн также является Лёгким, оперативник на выгодном террейне часто будет находиться в укрытии от оперативников, находящихся ниже него — представьте, что он
						пригибается, чтобы получить спасбросок укрытия или избежать статуса допустимой цели.
					</AppBlockquote>
					<AppBlockquote>
						Оперативник на выгодном террейне может выбрать целью оперативника в Скрытом приказе, который находится как минимум на 2" ниже его и только в укрытии от Лёгкого террейна.
					</AppBlockquote>
					<AppBlockquote>
						Если оперативник ограничен в перемещении по выгодному террейну вражескими оперативниками или другими элементами террейна, он может обходить эти препятствия (не спускаясь), пока
						часть его базы всегда остаётся на выгодном террейне.
					</AppBlockquote>

					<AppHeading :level="4" subtitle="Accessible">Проходимый</AppHeading>
					<p>
						Оперативники могут перемещаться сквозь проходимый террейн (это имеет приоритет над правилами Базы на стр. 46 и Террейн и перемещение на стр. 56), но для этого требуется
						дополнительно 1". Только центр базы оперативника должен перемещаться сквозь проходимый террейн, поэтому размеры базы не имеют значения.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/accessible_ter.png" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>Эта дверь — проходимый террейн.</p>
						</figcaption>
					</figure>
					<AppHeading :level="4" subtitle="Insignificant">Незначительный</AppHeading>
					<p>Незначительный террейн обычно очень мал. Для целей взбирания и спуска его игнорируют.</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/insignificant_ter.png" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<ol>
								<li>Небольшие посторонние детали, такие как эти штурмовые болтеры, являются незначительным террейном.</li>
								<li>Небольшие кучи обломков являются незначительным террейном.</li>
							</ol>
						</figcaption>
					</figure>
					<AppBlockquote>Оперативник может перемещаться поверх и через незначительный террейн, не поднимаясь и не спускаясь. </AppBlockquote>

					<AppHeading :level="4" subtitle="Exposed">Открытый</AppHeading>
					<p>
						Открытый террейн обычно очень мал, либо это террейн с большими промежутками, за которыми оперативники не должны иметь возможность получать укрытие. Для целей укрытия и
						заслонённости он никогда не находится на линии огня.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/exposed_ter.png" format="webp" class="w-full h-auto not-prose" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>Эта лестница и эти свисающие цепи являются открытым террейном.</p>
						</figcaption>
					</figure>
					<AppBlockquote>Особенно важно определить незначительный и открытый террейн до начала битвы, чтобы избежать недопонимания позже.</AppBlockquote>

					<AppHeading :level="4" subtitle="Ceiling">Потолочный</AppHeading>

					<p>
						Потолочный: Оперативники с круглой базой диаметром 50 мм или меньше, либо с овальной базой 60×35 мм, могут перемещаться под потолочным террейном независимо от высоты
						оперативника (это имеет приоритет над правилами Террейн и перемещение на стр. 56). Оперативник всё равно должен завершить действие в месте, где его можно разместить.
					</p>
				</template>
			</TwoColumnLayout>

			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="2" subtitle="Killzone: Volkus">Киллзона: волкус</AppHeading>
			<div class="flex flex-col gap-4 items-center justify-center">
				<div class="w-full shrink-0 items-center justify-center flex">
					<NuxtPicture src="/images/core-rules/killzone-volkus.png" format="webp" class="not-prose w-full block" :img-attrs="{ class: 'w-full h-auto block' }" />
				</div>
			</div>

			<p class="heading-font">Киллзона: Волкус включает 2x крепости, 2x большие руины, 2x малые руины, 2x тяжёлые обломки и 3x лёгкие обломки.</p>
			<AppHeading :level="3" subtitle="Stronghold">Крепость</AppHeading>
			<ul>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">A</span> Верхний уровень (уровни) элемента террейна «крепость» является выгодным и потолочным террейном.</li>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">B</span> Дверь является проходимым и тяжёлым террейном.</li>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">C</span> Огневые ступени являются выгодным, незначительным и открытым террейном.</li>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">D</span> Сломанный вентиляционный узел является блокирующим террейном.</li>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">E</span> Три контейнера-бочки являются блокирующим и тяжёлым террейном.</li>
				<li>
					<span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">F</span> Малые сломанные парапеты по краю выгодного террейна являются незначительным и открытым террейном.
				</li>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">G</span> Проём на нижнем выгодном террейне является проходимым террейном.</li>
				<li>
					<span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">H</span> На самом верхнем уровне одновременно не может находиться более одного дружественного оперативника, и
					этот оперативник должен быть размещён с одной из сторон этого уровня — его нельзя разместить в центре (это означает, что вражеского оперативника нельзя лишить возможности
					переместиться на другую сторону или быть там размещённым). Если база оперативника слишком велика, чтобы быть размещённой там, он должен переместиться (или быть размещён) настолько
					далеко, насколько возможно (в противном случае он не может завершить это перемещение), затем разместите его сбоку и считайте, что он находится там. Удерживайте его как можно дальше
					на этом уровне, когда это важно для проверки других правил (например, радиуса контроля, видимости, дистанции до других оперативников и т. д.). Это имеет приоритет над правилами баз
					и нахождения в месте, где его можно разместить.
				</li>
				<li>Все остальные части этого элемента являются Тяжёлым укрытием [Heavy Terrain].</li>
				<li>Для целей определения Радиуса Контроля, игнорируйте дверь и части этого элемента местности высотой менее 2", при определении видимости.</li>
			</ul>
			<div class="flex flex-col gap-4 items-center justify-center">
				<div class="w-full shrink-0 items-center justify-center flex">
					<NuxtPicture src="/images/core-rules/stronghold_03.png" format="webp" class="h-auto not-prose" />
				</div>
			</div>
			<AppHeading :level="3" subtitle="Large ruins">Большие руины</AppHeading>
			<ul>
				<li>
					<span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">A</span> Верхний уровень элемента террейна «большая руина» является потолочным и выгодным террейном. Для
					целей определения линии огня и выбора целей считайте этот уровень находящимся на той же высоте, что и первый верхний уровень элемента террейна «крепость».
				</li>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">B</span> Верхний парапет является лёгким террейном.</li>
				<li>
					<span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">C</span> Дверь является проходимым и тяжёлым террейном. Для целей радиуса контроля игнорируйте дверь при
					определении видимости.
				</li>
				<li><span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">D</span> Обзорное окошко двери является блокирующим террейном.</li>
				<li>
					<span class="font-bold px-2.5 py-1 rounded-full bg-primary text-white">E</span> Неповреждённые окна являются решётчатым и тяжёлым террейном.
					<p>
						<strong>Решётчатый террейн:</strong> видимость не может быть проведена сквозь этот террейн, если только оперативник и то, что он пытается увидеть, не находятся горизонтально в
						пределах 1" от него.
					</p>
				</li>
				<li>Все остальные части являются тяжёлым террейном.</li>
			</ul>

			<div class="grid grid-cols-1 lg:grid-cols-2 gap-4 place-items-center">
				<NuxtPicture src="/images/core-rules/large_ruin_0000_1.png" format="webp" class="w-full h-auto max-w-full not-prose" />

				<NuxtPicture src="/images/core-rules/large_ruin_0001_2.png" format="webp" class="w-full h-auto max-w-full not-prose" />
			</div>

			<AppHeading :level="3" subtitle="Small ruins">Малые руины</AppHeading>
			<ul>
				<li>Это тяжёлый террейн.</li>
			</ul>

			<div class="grid grid-cols-1 lg:grid-cols-2 gap-4 place-items-center">
				<NuxtPicture src="/images/core-rules/small_ruin_01.png" format="webp" class="w-full h-auto max-w-full not-prose" />

				<NuxtPicture src="/images/core-rules/small_ruin_02.png" format="webp" class="w-full h-auto max-w-full not-prose" />
			</div>
			<AppHeading :level="3" subtitle="Heavy rubble">Тяжёлые обломки</AppHeading>
			<ul>
				<li>Это тяжёлый террейн.</li>
			</ul>

			<div class="flex flex-col md:flex-row gap-4 items-center justify-center">
				<div class="w-full md:w-1/3 shrink-0 items-center justify-center flex">
					<NuxtPicture src="/images/core-rules/heavy_rubble_01.png" format="webp" class="h-auto not-prose" />
				</div>
				<div class="w-full md:w-1/3 shrink-0 items-center justify-center flex">
					<NuxtPicture src="/images/core-rules/heavy_rubble_02.png" format="webp" class="h-auto not-prose" />
				</div>
			</div>

			<AppHeading :level="3" subtitle="Light rubble">Лёгкие обломки</AppHeading>
			<ul>
				<li>Это лёгкий террейн.</li>
			</ul>

			<div class="flex flex-col md:flex-row gap-4 items-center justify-center">
				<div class="w-full md:w-1/3 shrink-0 items-center justify-center flex">
					<NuxtPicture src="/images/core-rules/light_rubble_01.png" format="webp" class="h-auto not-prose" />
				</div>
				<div class="w-full md:w-1/3 shrink-0 items-center justify-center flex">
					<NuxtPicture src="/images/core-rules/light_rubble_02.png" format="webp" class="h-auto not-prose" />
				</div>
				<div class="w-full md:w-1/3 shrink-0 items-center justify-center flex">
					<NuxtPicture src="/images/core-rules/light_rubble_03.png" format="webp" class="h-auto not-prose" />
				</div>
			</div>

			<TwoColumnLayout>
				<template #left>
					<AppBlockquote>
						Правило «Тесная крепость» всегда относится к местоположению цели, поэтому если основная цель целиком находится в крепости, а вторичная цель — нет, то это правило не применяется
						к этой вторичной цели.
					</AppBlockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Cityfight">Городской бой</AppHeading>
					<p>Киллзона: Волкус использует следующие дополнительные правила.</p>
					<AppHeading :level="4" subtitle="Condensed stronghold">Тесная крепость</AppHeading>
					<p>
						Всякий раз, когда оперативник выполняет выстрел оружием с правилами Взрывной, Шквальный и/или x" Сокрушительный (т.е. Сокрушительный с требованием по дистанции), это оружие
						также получает правило Смертоносный 5+ (стр. 111), если цель целиком находится в элементе террейна „крепость“ и на поверхности киллзоны или на огневой ступени.
					</p>
					<AppHeading :level="4" subtitle="Garrisoned stronghold">Гарнизонная крепость</AppHeading>
					<p>
						Когда оперативник, целиком находящийся в элементе террейна «крепость», выполняет ответную атаку против оперативника, который не находится в нём, защитник распределяет успехи
						первым (это имеет приоритет над обычным порядком распределения в драке).
					</p>

					<AppHeading :level="3" subtitle="Action">Действие</AppHeading>
					<p>Оперативники могут выполнять следующее универсальное действие.</p>
					<ActionCard
						title="Драка у двери"
						subtitle="Door fight"
						:level="4"
						:ap="1"
						:effects="[
							'<p>Выполните драку активным оперативником (см. последовательность драки на стр. 44).</p>',
							'<p>На этапе выбора вражеского оперативника, вместо этого выберите вражеского оперативника на поверхности киллзоны и в пределах 2&Prime;, по другую сторону двери, которой касается активный оперативник. На время выполнения этого действия эти оперативники считаются находящимися в радиусе контроля друг друга.</p>',
						]"
						:conditions="['<p>Это действие позволяет оперативнику сражаться сквозь дверь — полезно, если противник блокирует её и не даёт вашим оперативникам пройти.</p>']"
					/>
					<AppBlockquote>Это действие позволяет оперативнику сражаться через дверь — полезно, если противник её блокирует и мешает вашим оперативникам пройти через неё.</AppBlockquote>
				</template>
			</TwoColumnLayout>

			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="3" subtitle="Killzone: Gallowdark">Зона боя: Галлоударк</AppHeading>
			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="3" subtitle="Killzone: Bheta-Decima">Зона боя: Бета-Десима</AppHeading>
			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<AppHeading :level="3" subtitle="Killzone: Tomb World">Зона боя: Мир Гробниц</AppHeading>
			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="3" subtitle="Setting Up Killzones">Подготовка Killzone</AppHeading>

			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="2" subtitle="Weapon rules">Правила оружия</AppHeading>
			<p>
				Правила оружия применяются всякий раз, когда дружественный оперативник использует оружие, у которого они есть. Общие правила оружия приведены ниже, также вы можете найти редкие правила оружия в правилах вашего киллтима. Оружие не получает преимущества от наличия одного и того же правила оружия более одного раза, если только у правила оружия нет значения x, в этом случае выберите, какое значение x использовать. Если дружественный оперативник использует оружие, у которого есть несколько правил оружия, которые должны вступить в силу одновременно, вы можете выбрать порядок, в котором они вступают в силу.
			</p>
			<AppHeading :level="3" subtitle="Accurate">Точный x:</AppHeading>
			<p>Вы можете сохранить до x кубиков атаки как обычные успехи без их броска. Если у оружия есть более одного экземпляра Точный x, вы можете рассматривать это как один экземпляр Точный 2 вместо этого (это имеет приоритет над значениями x выше).</p>
			<AppHeading :level="3" subtitle="Balanced">Сбалансированный:</AppHeading>
			<p>Вы можете перебросить один из ваших кубиков атаки.</p>
			<AppHeading :level="3" subtitle="Blast">Взрывной x:</AppHeading>
			<p>Выбранная вами цель является основной целью. После выстрела по основной цели стреляйте этим оружием по каждой вторичной цели в порядке по вашему выбору (каждую последовательность бросков выполняйте отдельно). Вторичные цели — это другие оперативники, находящиеся в пределах x от основной цели, например Взрывной 2" (они все являются допустимыми целями, независимо от приказа Скрытый). Вторичные цели находятся в укрытии и заслонены, если основной целью было то же самое.</p>
			<AppHeading :level="3" subtitle="Brutal">Жестокий:</AppHeading>
			<p>Ваш противник может блокировать только критическими успехами.</p>
			<AppHeading :level="3" subtitle="Ceaseless">Неослабевающий:</AppHeading>
			<p>Вы можете перебросить любые результаты ваших кубиков атаки с одним значением (например, результаты 2).</p>
			<AppHeading :level="3" subtitle="Devastating">Разрушительный x:</AppHeading>
			<p>Каждый сохранённый критический успех немедленно наносит x урона оперативнику, против которого используется это оружие, например Разрушительный 3. Если правило начинается с дистанции (например 1" Разрушительный x), нанесите x урона этому оперативнику и каждому другому оперативнику, который видим и находится в пределах этой дистанции от него. Обратите внимание, что этот успех не сбрасывается после этого — он всё ещё может быть распределён позднее в последовательности.</p>
			<AppHeading :level="3" subtitle="Heavy">Тяжёлый:</AppHeading>
			<p>Оперативник не может использовать это оружие в активации или противодействии, в которых он двигался, и не может двигаться в активации или противодействии, в которых он использовал это оружие. Если правило — Тяжёлый (x только), где x — действие движения, разрешено только это движение, например Тяжёлый (рывок только). Это правило оружия не влияет на предотвращение действия Охрана.</p>
			<AppHeading :level="3" subtitle="Hot">Горячий:</AppHeading>
			<p>После того как оперативник использует это оружие, бросьте один D6. Если результат меньше характеристики попадания оружия, нанесите этому оперативнику урон, равный результату, умноженному на два. Если оно используется несколько раз в одном действии (например Взрывной), всё равно бросьте только один D6.</p>
			<AppHeading :level="3" subtitle="Lethal">Смертоносный x+:</AppHeading>
			<p>Ваши успехи, равные или превышающие x, являются критическими успехами, например Смертоносный 5+.</p>
			<AppHeading :level="3" subtitle="Limited">Ограниченный x:</AppHeading>
			<p>После того как оперативник использует это оружие количество раз в битве, равное x, у него больше его нет. Если оно используется несколько раз в одном действии (например Взрывной), считайте это одним использованием.</p>
			<AppHeading :level="3" subtitle="Piercing">Проникающий x:</AppHeading>
			<p>Защитник собирает на x кубиков защиты меньше, например Проникающий 1. Если правило — Проникающий Криты x, оно вступает в силу только если вы сохраняете какие-либо критические успехи.</p>
			<AppHeading :level="3" subtitle="Punishing">Карающий:</AppHeading>
			<p>Если вы сохраняете какие-либо критические успехи, вы можете сохранить один из ваших провалов как обычный успех вместо того, чтобы сбросить е</p>
			<AppHeading :level="3" subtitle="Range">Дальность x:</AppHeading>
			<p>Только оперативники в пределах x от активного оперативника могут быть допустимыми целями, например Дальность 9".</p>
			<AppHeading :level="3" subtitle="Relentless">Неумолимый:</AppHeading>
			<p>Вы можете перебросить любые ваши кубики атаки.</p>
			<AppHeading :level="3" subtitle="Rending">Разрывающий:</AppHeading>
			<p>Если вы сохраняете какие-либо критические успехи, вы можете сохранить один из ваших обычных успехов как критический успех вместо этого.</p>
			<AppHeading :level="3" subtitle="Saturate">Насыщающий:</AppHeading>
			<p>Защитник не может сохранять спасброски от укрытия.</p>
			<AppHeading :level="3" subtitle="Seek">Ищущий:</AppHeading>
			<p>При выборе допустимой цели оперативники не могут использовать террейн для укрытия. Если правило — Ищущий Лёгкий, оперативники не могут использовать Лёгкий террейн для укрытия. Хотя это может позволить таким оперативникам быть выбранными целями (при условии, что они находятся в видимости), это не убирает их спасбросок от укрытия (если он есть).</p>
			<AppHeading :level="3" subtitle="Severe">Серьёзный:</AppHeading>
			<p>Если вы не сохраняете никаких критических успехов, вы можете изменить один из ваших обычных успехов на критический успех. Правила оружия Разрушительный и Проникающий Криты всё ещё вступают в силу, но Карающий и Разрывающий — нет.</p>
			<AppHeading :level="3" subtitle="Shock">Шоковый:</AppHeading>
			<p>В первый раз, когда вы наносите удар критическим успехом в каждой последовательности, также сбросьте один из нераспределённых обычных успехов вашего противника (или критический успех, если обычных нет).</p>
			<AppHeading :level="3" subtitle="Silent">Бесшумное:</AppHeading>
			<p>Оперативник может выполнить действие Выстрел этим оружием, находясь в Скрытом приказе.</p>
			<AppHeading :level="3" subtitle="Stun">Оглушающий:</AppHeading>
			<p>Если вы сохраняете какие-либо критические успехи, вычтите 1 из предела очков действия оперативника, против которого используется это оружие, до конца его следующей активации.</p>
			<AppHeading :level="3" subtitle="Torrent">Поток x:</AppHeading>
			<p>Выберите допустимую цель как обычно в качестве основной цели, затем выберите любое количество других допустимых целей в пределах x от первой допустимой цели, но не в радиусе контроля дружественных оперативников, в качестве вторичных целей, например Поток 2". Стреляйте этим оружием по всем им в порядке по вашему выбору (каждую последовательность бросков выполняйте отдельно).</p>












		</article>
		<USeparator type="dashed" class="h-px" />
		<AppFooter />
		<TableOfContents :items="items" :active-id="activeId" @navigate="scrollTo" />
	</UContainer>
</template>

<style scoped>
blockquote {
	opacity: 0.5;
}
</style>

<!-- 
arcticons:eksi-sozluk
arcticons:shield


material-symbols:circle
ri:triangle-fill


material-symbols:arrow-back-2
f7:rhombus-fill
  -->

<!-- 

<ActionCard
					title=""
					subtitle=""
					:ap="1"
					:effects="['']"
					:conditions="['']"
					/>

-->
