<script setup lang="ts">
const { items, activeId, scrollTo } = useTableOfContents();
</script>

<template>
	<UContainer>
		<article
			class="prose dark:prose-invert min-w-full prose-blockquote:border-primary prose-li:marker:text-primary prose-blockquote:font-extralight prose-blockquote:italic prose-blockquote:text-primary prose-h1:uppercase prose-h1:mt-4"
		>
			<!-- ОСНОВНЫЕ ПРАВИЛА -->
			<AppHeading :level="1" subtitle="Core Rules">Основные правила</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />
			<p>
				<strong>Warhammer 40,000: Kill Team</strong> &mdash; тактическая игра в жанре скирмиша. Ударные команды из оперативников вступают в жестокие перестрелки и ближние бои, где требуется
				тщательное планирование перемещений, использование укрытий и захват ключевых целей.
			</p>

			<!-- Двухколоночный лейаут: комментарии слева, контент справа -->
			<TwoColumnLayout :reverse-on-mobile="false">
				<template #left>
					<blockquote>
						<p>В основных правилах встречаются примечания дизайнеров, подобные этому, которые дают дополнительный контекст и пояснения.</p>
					</blockquote>
					<blockquote>
						<p>
							Некоторые термины могут быть незнакомы. Они объясняются в разделе «Ключевые принципы» в алфавитном порядке, а в разделе «INDEX» есть удобный поиск правил. Не зацикливайтесь
							на них сразу — продолжайте читать, чтобы понять общий ход игры.
						</p>
					</blockquote>
				</template>

				<template #right>
					<p>Для игры в Kill Team вам понадобится:</p>
					<ul>
						<li>Команда убийц &mdash; набор миниатюр Citadel (оперативников) для каждого игрока.</li>
						<li>
							Правила для них (доступны бесплатно на английском языке на официальном сайте
							<a href="https://www.warhammer-community.com/en-gb/downloads/kill-team/" target="_blank">warhammer-community.com</a> ).
						</li>
						<li>Измерительное устройство в дюймах.</li>
						<li>Минимум 10 шестигранных кубиков (D6).</li>
						<li>Жетоны и маркеры.</li>
						<li>Зона боя &mdash; игровое поле и элементы ландшафта.</li>
						<li>Набор миссий.</li>
					</ul>
					<p>
						Каждая игра следует определённой последовательности, которая описывает, как настроить игровое поле, подготовить ударную команду и добиться победы. Для наборов миссий из этой
						книги последовательность дана на стр. 110, в других наборах она представлена отдельно.
					</p>
					<p>
						Основной этап игры &mdash; битва, где оперативники сражаются, а вы стремитесь к победе. Битва состоит из нескольких ходов игры, каждый из которых включает фазу стратегии и фазу
						боя. Их нужно выполнять в строгом порядке, после чего ход завершается, и начинается следующий. Повторяйте этот процесс, пока битва не закончится, как указано в наборе миссий.
					</p>
					<p>
						<strong>ПОВТОРЯТЬ ДО ОКОНЧАНИЯ БИТВЫ:</strong>
					</p>
					<ul>
						<li>НАЧАЛО ХОДА</li>
						<li>ФАЗА СТРАТЕГИИ</li>
						<li>ФАЗА БОЯ</li>
						<li>ЗАВЕРШЕНИЕ ХОДА</li>
					</ul>
				</template>
			</TwoColumnLayout>
			<!-- ОСНОВНЫЕ ПРАВИЛА /-->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!-- ФАЗА СТРАТЕГИИ -->
			<AppHeading :level="2" subtitle="Strategy Phase">Фаза стратегии</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />
			<TwoColumnLayout>
				<template #left>
					<blockquote>
						В некоторых наборах миссий инициатива определяется при подготовке битвы. Игрок с инициативой решает порядок разрешения правил, которые происходят одновременно до начала битвы.
					</blockquote>
				</template>

				<template #right>
					<AppHeading :level="3" subtitle="Initiative">1. Инициатива</AppHeading>

					<ul>
						<li>
							Игрок с инициативой активирует первым в ходе игры и решает порядок разрешения правил, которые происходят одновременно. В первом ходе инициатива определяется
							последовательностью игры из набора миссий. В последующих ходах игроки проводят жеребьёвку, и победитель решает, кто получает инициативу. Если жеребьёвка заканчивается
							ничьей, игрок, не имевший инициативу в предыдущем ходе, решает, кто её получит (это имеет приоритет над жеребьёвкой и ничьей).
						</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<TwoColumnLayout>
				<template #left>
					<blockquote>CP — ценный ресурс для активации дополнительных правил, называемых хитростями.</blockquote>

					<blockquote>Жетон приказа светлой стороной вверх показывает, что оперативник в готовности.</blockquote>

					<div class="flex justify-center">
						<NuxtPicture src="/images/core-rules/tokens.png" format="webp" />
					</div>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Ready">2. Готовность</AppHeading>
					<ul>
						<li>Каждый игрок получает 1 командное очко (CP). В каждом ходе после первого, игрок без инициативы получает 2 CP. Неизрасходованные CP сохраняются.</li>
						<li>Каждый игрок приводит в готовность всех своих оперативников.</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<TwoColumnLayout>
				<template #right>
					<AppHeading :level="3" subtitle="Gambit">3. Манёвр</AppHeading>
					<ul>
						<li>
							Начиная с игрока с инициативой, игроки по очереди либо используют стратегический манёвр, либо пасуют. Процесс повторяется, пока оба игрока не пасуют подряд. Стратегические
							хитрости &mdash; наиболее распространённый тип стратегического манёвра. Каждый стратегический манёвр можно использовать только один раз за ход.
						</li>
					</ul>
				</template>
			</TwoColumnLayout>
			<!-- ФАЗА СТРАТЕГИИ /-->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!-- ФАЗА БОЯ -->
			<AppHeading :level="2" subtitle="Firefight Phase">Фаза боя</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />
			<p>
				Игрок с инициативой активирует одного готового дружеского оперативника. После завершения активации противник активирует одного из своих готовых оперативников. Игроки повторяют этот
				процесс, чередуя активации, пока все оперативники одного игрока не станут истощёнными. В этом случае игрок может выполнять контратаки между оставшимися активациями противника. Когда
				все оперативники истощены, фаза боя заканчивается.
			</p>
			<AppHeading :level="3" class="mb-8 uppercase">Последовательность активации дружественного оперативника:</AppHeading>
			<div class="flex flex-col gap-4 text-xs sm:text-sm lg:text-base">
				<div class="flex justify-center items-center">
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">1. Определение приказа</div>
					<div class="w-2/12 flex justify-center items-center"><Icon name="iwwa:arrow-down" class="rotate-270 text-primary" size="32" /></div>
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">2. Выполнение действий</div>
				</div>
				<div class="flex justify-center items-center">
					<div class="w-5/12 flex justify-center items-center"><Icon name="iwwa:arrow-down" class="rotate-180 text-primary" size="32" /></div>
					<div class="w-2/12 flex justify-center items-center"><p class="text-center text-[10px] sm:text-xs">повторять до истощения всех оперативников</p></div>
					<div class="w-5/12 flex justify-center items-center"><Icon name="iwwa:arrow-down" class="text-primary" size="32" /></div>
				</div>
				<div class="flex justify-center items-center">
					<div class="bg-amber-500 dark:bg-amber-800 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">
						Активация следующего игрока
					</div>
					<div class="w-2/12 flex justify-center items-center"><Icon name="iwwa:arrow-down" class="text-primary rotate-90" size="32" /></div>
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex items-center justify-self-start">3. ИСТОЩЕНИЕ</div>
				</div>

				<div class="flex justify-center items-center">
					<div class="w-5/12 flex justify-center items-center"><Icon name="iwwa:arrow-down" class="text-primary rotate-180" size="32" /></div>
					<div class="w-2/12 flex justify-center items-center" />
					<div class="w-5/12 flex justify-center items-center" />
				</div>

				<div class="flex justify-center items-center">
					<div class="dark:bg-black bg-zinc-200 border border-primary py-2 px-4 lg:py-3 lg:px-6 w-5/12 uppercase font-bold flex flex-col justify-center gap-2 lg:gap-4">
						<span class="lowercase font-normal text-[8px] sm:text-[10px] lg:text-xs">* Если все ваши оперативники истощены, а у соперника нет, выполните: </span>Контратака
					</div>
					<div class="w-2/12 flex justify-center items-center" />
					<div class="w-5/12 flex justify-center items-center" />
				</div>
			</div>

			<AppHeading :level="3" subtitle="Determine order">1. Определение приказа</AppHeading>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>Правильный выбор приказа для оперативников — ключ к успеху. После нескольких игр вы лучше поймёте, когда использовать приказ «В бой», а когда — «В укрытие».</p>
					</blockquote>
				</template>

				<template #right>
					<ul>
						<li>Выберите приказ оперативника (&laquo;В бой&raquo; или &laquo;В укрытие&raquo;). Этот приказ сохраняется до следующей активации оперативника.</li>
					</ul>
					<div class="flex flex-row w-full items-center gap-4 mb-2">
						<div class="w-16 min-w-16 shrink-0">
							<NuxtPicture src="/images/core-rules/Engage.png" format="webp" />
						</div>
						<p class="flex-1"><strong>В БОЙ:</strong> Оперативник может выполнять действия как обычно и может «Контратаковать».</p>
					</div>
					<div class="flex flex-row w-full items-center gap-4">
						<div class="w-16 min-w-16 shrink-0">
							<NuxtPicture src="/images/core-rules/Conceal.png" format="webp" />
						</div>
						<p class="flex-1">
							<strong>В УКРЫТИЕ:</strong> Оперативник не может выполнять действия «Стрельба» и «Наскок» и не может «Контратаковать». Однако он не является допустимой целью, пока
							находится в укрытии.
						</p>
					</div>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<AppHeading :level="3" subtitle="Perform actions">2. Выполнение действий</AppHeading>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>
							Оперативник с APL 2 может выполнить действия «Перемещение» (1 AP) и «Стрельба» (1 AP), в сумме 2 AP, но не может выполнить «Отход» (2 AP) и «Стрельба» (1 AP), так как это 3
							AP.
						</p>
					</blockquote>
				</template>

				<template #right>
					<ul>
						<li>
							<p>Оперативник выполняет действия. Во время выполнения он считается активным оперативником.</p>
						</li>
						<li>
							<p>
								Каждое действие стоит очки действий (AP), и вы не можете потратить больше AP за активацию, чем имеющийся лимит очков действий оперативника (APL, см. карточки данных).
								Оперативник не может выполнять одно и то же действие более одного раза за активацию &mdash; это называется ограничением действий. Некоторые редкие правила могут
								изменять стоимость действий. Независимо от изменений, минимальная стоимость действия всегда 0 AP. Это имеет приоритет над всеми изменениями AP.
							</p>
						</li>
						<li><p>Не нужно объявлять все действия оперативника при активации. Оперативник может выполнить одно действие, после чего вы можете выбрать следующее, оценив результат.</p></li>
						<li>
							<p>
								Если действие объявлено или начато, но его невозможно завершить, оно отменяется. Вернитесь к состоянию игры до начала действия. Например, если оперативник начал
								перемещение, но не может его завершить, верните его на исходную позицию; действие не выполнено, и AP не потрачены.
							</p>
						</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<div class="flex justify-center text-primary">
				<Icon name="iwwa:arrow-down" size="64" />
			</div>

			<AppHeading :level="3" subtitle="Expended">3. Истощение</AppHeading>

			<TwoColumnLayout>
				<template #left>
					<blockquote><p>Жетон приказа тёмной стороной вверх показывает, что оперативник истощён.</p></blockquote>
					<div class="flex justify-center max-h-24 items-center">
						<NuxtPicture src="/images/core-rules/tokens.png" format="webp" class="h-fit" />
					</div>
					<blockquote><p>Все ваши оперативники истощены, а у противника — нет? —> КОНТРАТАКА</p></blockquote>
					<blockquote><p>Контратака — это не активация, а её замена. Это важно: например, ограничения действий не применяются.</p></blockquote>
				</template>

				<template #right>
					<ul>
						<li>
							<p>После завершения активации оперативник становится истощённым. Истощённый оперативник не находится в готовности.</p>
						</li>
					</ul>
					<div class="border border-primary px-6 m-6 bg-zinc-100 dark:bg-zinc-800">
						<AppHeading :level="4" subtitle="Сounteract">Контратака</AppHeading>
						<p>
							Когда вы должны активировать готового дружественного оперативника, но все ваши оперативники истощены, а у противника остались готовые оперативники, вы можете выбрать
							истощенного дружественного оперативника с приказом «В бой» для выполнения действия стоимостью 1AP (кроме действия «Охрана») бесплатно. Каждый оперативник может
							контратаковать только один раз за ход. Такой оперативник не может двигаться более чем на 2 дюйма или должен быть размещен полностью в пределах 2 дюймов, если он был удален
							и размещен заново, во время контратаки (это не изменение характеристики «Движение» и имеет приоритет над всеми другими правилами). Контратака необязательна, так что вы
							можете выбрать не выполнять ее. В любом случае после этого активируйте одного из оперативников противника.
						</p>
					</div>
				</template>
			</TwoColumnLayout>

			<!-- ФАЗА БОЯ /-->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!-- ДЕЙСТВИЯ -->
			<AppHeading :level="2" subtitle="Actions">Действия</AppHeading>
			<USeparator color="primary" type="solid" size="lg" />

			<p>
				Действия имеют эффекты ( <Icon name="material-symbols:arrow-back-2" class="rotate-180 text-green-500 align-middle" /> ) и условия (
				<Icon name="f7:rhombus-fill" class="text-red-500 align-middle" /> ). — это эффекты, которые должны быть выполнены, чтобы оперативник мог совершить действие. — условия, которые должны
				быть соблюдены для оперативника во время выполнения действия.
			</p>
			<p><Icon name="material-symbols:arrow-back-2" class="rotate-180 text-green-500 align-middle" /> — это эффекты, которые должны быть выполнены, чтобы оперативник мог совершить действие.</p>
			<p><Icon name="f7:rhombus-fill" class="text-red-500 align-middle" />— условия, которые должны быть соблюдены для оперативника во время выполнения действия.</p>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>Если оперативник выполняет свободное действие вне своей активации, это не мешает ему выполнить это действие во время активации, и наоборот.</p>
					</blockquote>
				</template>

				<template #right>
					<p>Существует четыре типа действий: универсальные, уникальные, миссионные и свободные:</p>

					<ul>
						<li>
							<p><strong>Универсальные действия</strong> — наиболее распространённые, их могут выполнять все оперативники, если не указано иное.</p>
						</li>
						<li>
							<p><strong>Уникальные действия</strong> — более редкие, указаны в правилах вашей ударной команды. Их могут выполнять только определённые оперативники.</p>
						</li>
						<li>
							<p><strong>Миссионные действия</strong> — зависят от миссии или зоны боя. Если они есть, они указаны в наборе миссий, правилах зоны боя или выбранном снаряжении.</p>
						</li>
						<li>
							<p><strong>Свободные действия</strong> — можно выполнять только по указанию других правил, при этом:</p>

							<ul class="list-[circle]">
								<li>Условия действия должны быть выполнены.</li>
								<li>Действие не требует дополнительных AP.</li>
								<li>
									Оперативник считается выполнившим действие для всех других правил. Например, если он выполнил действие во время активации, он не сможет выполнить его снова в этой
									активации.
								</li>
							</ul>
						</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<AppHeading :level="3" subtitle="Universal actions">Универсальные действия</AppHeading>
			<TwoColumnLayout>
				<template #left>
					<div class="flex flex-col justify-between h-full">
						<blockquote><p>Перемещение с шагом позволяет добиться большей точности и четкости.</p></blockquote>
						<blockquote><p>Перемещения выполняются в прямолинейных отрезках, а не по кривым вокруг углов.</p></blockquote>
						<blockquote><p>Эти движения выполняются с шагом по прямой, а не по дуге за углом.</p></blockquote>
					</div>
				</template>

				<template #right>
					<ActionCard
						title="Перемещение"
						subtitle="Reposition"
						:level="4"
						:ap="1"
						:effects="[
							'<p>Переместите активного оперативника на расстояние до его характеристики <em>&laquo;Движение&raquo;</em> в место, где он может быть размещён. Перемещение выполняется в одном или нескольких прямолинейных отрезках, при этом отрезки всегда округляются вверх до ближайшего дюйма.</p>',
							'<p>Оперативник не может войти в зону контроля вражеского оперативника, если там нет других дружеских оперативников. Если же хотя бы один дружеский оперативник уже находится в зоне контроля этого врага, оперативник может войти в неё, но не может там остаться после завершения перемещения.</p>',
						]"
						:conditions="[
							'Оперативник не может выполнять это действие, находясь в зоне контроля вражеского оперативника или в той же активации, в которой он выполнил действие «Отступление» или «Наскок».',
						]"
					/>
					<div class="grid grid-cols-1 md:grid-cols-2 gap-4 mt-4">
						<figure class="m-0 flex flex-col items-center">
							<NuxtPicture src="/images/core-rules/move1.jpg" format="webp" />
							<figcaption class="text-sm text-center mt-2">
								Оперативник с характеристикой «Движение» 6 дюймов сначала перемещается на 2 дюйма, чтобы обойти угол стены, затем перемещается на 4 дюйма — оставшееся значение
								характеристики «Движение».
							</figcaption>
						</figure>
						<figure class="m-0 flex flex-col items-center">
							<NuxtPicture src="/images/core-rules/move2.jpg" format="webp" />
							<figcaption class="text-sm text-center mt-2">
								Оперативник сначала перемещается на 0,5 дюйма, чтобы обойти угол стены, но, так как отрезки округляются вверх, это считается 1 дюймом. Затем он перемещается на 2,75
								дюйма, но это округляется до 3 дюймов. В общей сложности он переместился на 4 дюйма.
							</figcaption>
						</figure>
					</div>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>Поскольку оперативники не могут выполнять одно и то же действие дважды за активацию, <strong>&laquo;Рывок&raquo;</strong> позволяет оперативникам перемещаться дальше.</p>
					</blockquote>
				</template>

				<template #right>
					<ActionCard
						title="Рывок"
						subtitle="Dash"
						:ap="1"
						:effects="[
							'<p>То же, что действие <strong>&laquo;Перемещение&raquo;</strong>, но вместо характеристики <em>Движение</em> оперативник может переместиться только на 3 дюйма. Кроме того, он не может лазать во время этого перемещения, но может падать или прыгать.</p>',
						]"
						:conditions="[
							'<p>Оперативник не может выполнять это действие, находясь в зоне контроля вражеского оперативника или в той же активации, в которой он выполнил действие <strong>&laquo;Наскок&raquo;</strong>.</p>',
						]"
					/>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>
							Если оперативник активируется в зоне контроля вражеского оперативника, действие <strong>&laquo;Отступление&raquo;</strong> позволяет отступить. Оно стоит 2AP, поэтому
							большинство оперативников не смогут выполнить другие действия в этой активации.
						</p>
					</blockquote>
				</template>

				<template #right>
					<ActionCard
						title="Отступление"
						subtitle="Fall back"
						:ap="2"
						:effects="[
							'<p>То же, что действие <strong>&laquo;Перемещение&raquo;</strong>, но оперативник может перемещаться в зоне контроля вражеского оперативника, но не может завершить перемещение там.</p>',
						]"
						:conditions="[
							'<p>Оперативник не может выполнять это действие, если в его зоне контроля нет вражеского оперативника. Он не может выполнять это действие в той же активации, в которой выполнил действия <strong>&laquo;Перемещение&raquo;</strong> или <strong>&laquo;Наскок&raquo;</strong>.</p>',
						]"
					/>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>
							Действие <strong>&laquo;Наскок&raquo;</strong> позволяет оперативникам эффективно атаковать врагов, но, поскольку для этого требуется приказ <em>&laquo;В бой&raquo;</em>,
							они становятся уязвимыми для вражеской стрельбы позже.
						</p>
					</blockquote>
				</template>

				<template #right>
					<ActionCard
						title="Наскок"
						subtitle="Charge"
						:ap="1"
						:effects="[
							'<p>То же, что действие <strong>&laquo;Перемещение&raquo;</strong>, но оперативник может переместиться на дополнительные 2 дюйма.</p>',
							'<p>Он может переместиться и должен завершить перемещение в зоне контроля вражеского оперативника. Если он перемещается в зону контроля вражеского оперативника, в которой нет других дружеских оперативников, он не может покинуть эту зону контроля.</p>',
						]"
						:conditions="[
							'<p>Оперативник не может выполнять это действие, если у него приказ <em>&laquo;В укрытие&raquo;</em>, если он уже находится в зоне контроля вражеского оперативника или в той же активации, в которой он выполнил действия <strong>&laquo;Перемещение&raquo;</strong>, <strong>&laquo;Рывок&raquo;</strong> или <strong>&laquo;Отступление&raquo;</strong>.</p>',
						]"
					/>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>Если есть маркеры, на которые можно выполнить действие <strong>&laquo;Поднять маркер&raquo;</strong>, это будет указано в другом месте, например, в наборе миссий.</p>
					</blockquote>
				</template>

				<template #right>
					<ActionCard
						title="Поднять маркер"
						subtitle="Pick up marker"
						:ap="1"
						:effects="[
							'<p>Уберите маркер, который контролирует активный оперативник и на который можно выполнить действие <strong>&laquo;Поднять маркер&raquo;</strong>. Теперь оперативник несёт, оспаривает и контролирует этот маркер.</p>',
						]"
						:conditions="['<p>Оперативник не может выполнять это действие, находясь в зоне контроля вражеского оперативника или неся другой маркер.</p>']"
					/>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote><p>Как указано выше, если оперативник несёт маркеры, это будет указано в другом месте.</p></blockquote>
				</template>

				<template #right>
					<ActionCard
						title="Установить маркер"
						subtitle="Place marker"
						:ap="1"
						:effects="[
							'<p>Разместите маркер, который несёт активный оперативник, в пределах его зоны контроля.</p>',
							'<p>Если оперативник, несущий маркер, выведен из строя, он должен выполнить это действие перед удалением из зоны боя, но делает это за 0 AP. Это имеет приоритет над всеми правилами, которые препятствуют выполнению действия.</p>',
						]"
						:conditions="[
							'<p>Оперативник не может выполнять это действие в той же активации, в которой он уже выполнил действие <strong>&laquo;Поднять маркер&raquo;</strong> (если только он не выведен из строя).</p>',
						]"
					/>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<div class="flex flex-col justify-between h-full">
						<blockquote>
							<p>
								Неудивительно, что Kill Team может быть очень смертоносной игрой, поэтому, если вы часто теряете оперативников из-за вражеской стрельбы, попробуйте играть более
								оборонительно, размещая оперативников в укрытиях с приказом <em>&laquo;В укрытие&raquo;</em>.
							</p>
						</blockquote>

						<blockquote>
							<p>
								В редких случаях вы можете быть одновременно атакующим и защищающимся, например, при стрельбе по дружескому оперативнику из-за правила оружия &laquo;Взрыв&raquo;. В
								этом случае вы бросаете кубики атаки и защиты (а не ваш противник).
							</p>
						</blockquote>
						<blockquote>
							<p>
								Заслонение означает, что стрельба по вражескому оперативнику через крупные препятствия менее эффективна. Однако это игнорируется, когда оперативники находятся очень
								близко к&nbsp;таким препятствиям &mdash; представьте, что они высовываются из-за углов или стреляют через окна.
							</p>
						</blockquote>
						<blockquote>
							<p>
								Помните, что укрытие в этом шаге обычно применяется к оперативникам с приказом &laquo;В бой&raquo;, так как приказ &laquo;В укрытие&raquo; уже предотвратил бы их выбор
								в качестве допустимой цели.
							</p>
						</blockquote>
						<blockquote>
							<p>
								Некоторые оружия стреляют несколько раз за одно действие, например, с правилами &laquo;Взрыв&raquo; или &laquo;Поток&raquo;. Поэтому оперативники не удаляются, пока всё
								действие не будет разрешено.
							</p>
						</blockquote>
					</div>
				</template>

				<template #right>
					<ActionCard
						title="Стрельба"
						subtitle="Shoot"
						:ap="1"
						:effects="[
							'<p>Выполните стрельбу активным оперативником, следуя приведённой ниже последовательности. Активный оперативник &mdash; атакующий. Игрок выбранного вражеского оперативника &mdash; защищающийся.</p>',
						]"
						:conditions="[
							'<p>Оперативник не может выполнять это действие, если у него приказ <em>&laquo;В укрытие&raquo;</em> или если он находится в зоне контроля вражеского оперативника.</p>',
						]"
					/>

					<AppHeading :level="5" subtitle="select weapon" class="mt-7">1. Выбор оружия</AppHeading>
					<p>Атакующий выбирает одно дальнобойное оружие, которое есть у оперативника, и собирает кубики атаки &mdash; количество D6, равное характеристике <em>Атака</em> оружия.</p>

					<AppHeading :level="5" subtitle="select valid target" class="mt-7">2. Выбор допустимой цели</AppHeading>
					<p>Атакующий выбирает вражеского оперативника, который является допустимой целью и в зоне контроля которого нет дружеских оперативников.</p>
					<ul class="list-none p-0 flex flex-col gap-4">
						<li class="flex items-center gap-4">
							<div class="w-20 md:w-24 shrink-0">
								<NuxtPicture src="/images/core-rules/engage_2_sides.png" format="webp" class="w-full h-auto" />
							</div>
							<p class="m-0 flex-1">Если у предполагаемой цели приказ &laquo;В бой&raquo;, она является допустимой целью, если видима для активного оперативника.</p>
						</li>
						<li class="flex items-center gap-4">
							<div class="w-20 md:w-24 shrink-0">
								<NuxtPicture src="/images/core-rules/conceal_2_sides.png" format="webp" class="w-full h-auto" />
							</div>
							<p class="m-0 flex-1">
								Если у предполагаемой цели приказ &laquo;В укрытие&raquo;, она является допустимой целью, если видима для активного оперативника и не находится в укрытии.
							</p>
						</li>
					</ul>
					<p>
						Оперативник видим, если активный оперативник может его видеть. Оперативник находится в укрытии, если в его зоне контроля есть препятствующий ландшафт. Однако он не может быть в
						укрытии, находясь в пределах 2 дюймов от активного оперативника.
					</p>
					<p>
						Оперативник не может одновременно находиться в укрытии и быть заслонённым от одной и той же особенности ландшафта. Если это возможно, защитник должен выбрать одно из них
						(укрытие или заслонение) для этой последовательности, когда его оперативник выбран в качестве допустимой цели.
					</p>

					<AppHeading :level="5" subtitle="roll range attack dice" class="mt-7">3. Бросок кубиков атаки</AppHeading>
					<p>
						Атакующий бросает кубики атаки. Каждый результат, равный или превышающий характеристику <em>Попадание</em> оружия, считается успехом и сохраняется. Каждый результат ниже
						&mdash; провал и отбрасывается. Каждый результат 6 &mdash; всегда критический успех. Каждый другой успех &mdash; обычный успех. Каждый результат 1 &mdash; всегда провал.
					</p>
					<p>Если цель заслонена:</p>
					<ul>
						<li>Атакующий должен отбросить один успех по своему выбору вместо того, чтобы сохранить его.</li>
						<li>Все критические успехи атакующего сохраняются как обычные успехи и не могут быть изменены на критические успехи (это имеет приоритет над всеми другими правилами).</li>
					</ul>
					<p>
						Оперативник заслонён, если между ним и атакующим есть препятствующий тяжёлый ландшафт. Однако он не может быть заслонён тяжёлым ландшафтом, который находится в пределах 1 дюйма
						от любого из оперативников.
					</p>
					<AppHeading :level="5" subtitle="roll defence dice" class="mt-7">4. Бросок кубиков защиты</AppHeading>
					<p>
						Защищающийся собирает три кубика защиты. Если цель находится в укрытии, она может сохранить один обычный успех без броска &mdash; это называется спасброском за укрытие.
						Остальные кубики она бросает.
					</p>
					<p>
						Каждый результат, равный или превышающий характеристику <em>Спасбросок</em> цели, считается успехом и сохраняется. Каждый результат ниже &mdash; провал и отбрасывается. Каждый
						результат 6 &mdash; всегда критический успех. Каждый другой успех &mdash; обычный успех. Каждый результат 1 &mdash; всегда провал.
					</p>

					<AppHeading :level="5" subtitle="resolve defence dice" class="mt-7">5. Распределение кубиков защиты</AppHeading>
					<p>Защищающийся распределяет все свои успешные кубики защиты для блокировки успешных кубиков атаки.</p>
					<ul>
						<li>Обычный успех может блокировать обычный успех.</li>
						<li>Два обычных успеха могут блокировать критический успех.</li>
						<li>Критический успех может блокировать обычный успех или критический успех.</li>
					</ul>
					<AppHeading :level="5" subtitle="resolve range attack dice" class="mt-7">6. Распределение кубиков атаки</AppHeading>

					<p>Все успешные не заблокированные кубики атаки наносят урон цели.</p>
					<ul>
						<li>Обычный успех наносит урон, равный характеристике &laquo;Обычный урон&raquo; оружия.</li>
						<li>Критический успех наносит урон, равный характеристике &laquo;Критический урон&raquo; оружия.</li>
					</ul>
					<p>Все оперативники, которые были выведены из строя, удаляются после того, как активный оперативник завершит действие.</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>В отличие от стрельбы, рукопашный бой &mdash; это жестокая схватка с обоюдными ударами. Внимательно выбирайте, с кем вступать в бой, так как противник будет отвечать.</p>
					</blockquote>
					<blockquote>
						<p>Если в правилах сказано, что оперативник не может наносить ответные удары, то по нему всё равно можно вести бой, но он не может собирать или разыгрывать кубики атаки.</p>
					</blockquote>
				</template>

				<template #right>
					<ActionCard
						title="Рукопашный бой"
						subtitle="Fight"
						:ap="1"
						:effects="[
							'<p>Выполните рукопашный бой активным оперативником, следуя приведённой ниже последовательности. Игрок активного оперативника &mdash; атакующий. Игрок выбранного вражеского оперативника &mdash; защищающийся.</p>',
						]"
						:conditions="['<p>Оперативник не может выполнять это действие, если в его зоне контроля нет вражеского оперативника.</p>']"
					/>

					<AppHeading :level="5" subtitle="select enemy operative">1. Выбор вражеского оперативника</AppHeading>
					<p>Атакующий выбирает вражеского оперативника в зоне контроля активного оперативника для боя. Этот вражеский оперативник будет отвечать в этом действии.</p>
					<blockquote class="opacity-50">
						<p>
							Разница между тем, когда оперативник сражается и когда он отвечает, важна. Сражающийся оперативник — это активный оперативник, а отвечающий — выбранный вражеский
							оперативник.
						</p>
					</blockquote>
					<AppHeading :level="5" subtitle="select weapons">2. Выбор оружия</AppHeading>
					<p>Оба игрока выбирают одно оружие ближнего боя для своих оперативников и собирают кубики атаки — количество D6, равное характеристике «Атака» оружия.</p>
					<AppHeading :level="5" subtitle="roll melee attack dice">3. Бросок кубиков атаки</AppHeading>
					<p>
						Оба игрока одновременно бросают кубики атаки. Каждый результат, равный или превышающий характеристику &laquo;Попадание&raquo; оружия, считается успехом и сохраняется. Каждый
						результат ниже &mdash; провал и отбрасывается. Каждый результат 6 &mdash; всегда критический успех. Каждый другой успех &mdash; обычный успех. Каждый результат 1 &mdash; всегда
						провал.
					</p>
					<p>
						Если дружескому оперативнику помогают, его характеристика &laquo;Попадание&raquo; для оружия ближнего боя улучшается на 1 за каждого помощника. Для помощи дружеский оперативник
						должен находиться в зоне контроля вражеского оперативника, участвующего в бою, и не находиться в зоне контроля другого вражеского оперативника.
					</p>
					<blockquote class="opacity-50">
						<p>Если правило указывает, что оперативник не может отвечать, его всё равно можно атаковать, но для него нельзя собирать или разрешать кубики атаки.</p>
					</blockquote>
					<blockquote class="opacity-50">
						<p>
							Наличие нескольких дружеских оперативников в зоне контроля вражеского оперативника не позволяет им всем сражаться одновременно, но помощь увеличивает вероятность успешных
							кубиков атаки.
						</p>
					</blockquote>
					<AppHeading :level="5" subtitle="resolve melee attack dice">4. Распределение кубиков атаки</AppHeading>
					<p>
						Начиная с атакующего, игроки по очереди распределяют один из своих успешных не заблокированных кубиков атаки. Этот процесс повторяется, пока один из игроков не распределит все
						свои кубики (в этом случае противник распределяет все свои оставшиеся кубики) или оперативник в бою не будет выведен из строя (см. &laquo;Урон&raquo;). При распределении
						кубика, игрок должен либо нанести удар, либо блокировать.
					</p>
					<p>При нанесении удара наносится урон вражескому оперативнику, после чего кубик отбрасывается:</p>
					<ul>
						<li>Обычный успех наносит урон, равный характеристике &laquo;Обычный урон&raquo; оружия.</li>
						<li>Критический успех наносит урон, равный характеристике &laquo;Критический урон&raquo; оружия.</li>
					</ul>
					<p>При блокировке, кубик используется для блокировки одного из не распределённых успехов противника:</p>
					<ul>
						<li>Обычный успех может блокировать обычный успех.</li>
						<li>Критический успех может блокировать обычный успех или критический успех.</li>
					</ul>
					<blockquote class="opacity-50">
						<p>Нанесение удара сразу наносит урон, так что это может быть эффективным способом нанесения урона.</p>
					</blockquote>
					<blockquote class="opacity-50">
						<p>Блокировка не останавливает уже нанесённый удар, она предотвращает разрешение ещё не использованного успеха.</p>
					</blockquote>
					<blockquote class="opacity-50">
						<p>Вы можете блокировать, даже если у противника не осталось неразрешённых успехов. Это полезно, если вы пока не хотите наносить урон вражескому оперативнику.</p>
					</blockquote>
				</template>
			</TwoColumnLayout>

			<!-- ДЕЙСТВИЯ /-->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!--  -->

			<AppHeading :level="2" subtitle="Key Principles">Ключевые принципы</AppHeading>

			<TwoColumnLayout>
				<template #right>
					<AppHeading :level="3" subtitle="Bases">Базы</AppHeading>
					<p>
						Все оперативники размещены на базах. База является важной частью миниатюры с точки зрения правил, особенно для измерения расстояний. Размер базы каждого оперативника указан в
						его карточке данных. Боковые стороны разных баз могут касаться друг друга, но база не может быть размещена на другой базе. Дружественные оперативники могут проходить сквозь
						других дружественных оперативников (через их базу и миниатюру), но не сквозь вражеских оперативников. Базы не могут проходить сквозь ландшафт или находиться за краем зоны боя.
					</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>Представьте зону контроля как область взаимодействия оперативника с объектами, находящимися поблизости.</p>
					</blockquote>
				</template>

				<template #right>
					<AppHeading :level="3" subtitle="Control Range">Зона контроля</AppHeading>
					<p>
						Многие правила связаны с зоной контроля, например, перемещение, рукопашный бой и использование укрытий. Объект находится в пределах зоны контроля оперативника, если он видим
						для этого оперативника и находится в пределах 1 дюйма от него.
					</p>
					<p>
						Зона контроля между оперативниками является взаимной, поэтому оперативники находятся в зоне контроля друг друга, если один из них видим для другого и находится в пределах 1
						дюйма от него.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/control_range.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>Оперативники A и B находятся в зоне контроля друг друга.</p>
							<p>Ландшафт находится в зоне контроля как оперативника B, так и оперативника C.</p>
							<p>Из-за ландшафта оперативник B невидим для оперативника C, и наоборот, поэтому они не находятся в зоне контроля друг друга.</p>
						</figcaption>
					</figure>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>
							Оперативник в укрытии с приказом «В укрытие» не является допустимой целью. Оперативник в укрытии с приказом «В бой» является допустимой целью, но имеет спасбросок за
							укрытие (см. действие <a href="#shoot" class="text-primary">«Стрельба»</a>).
						</p>
					</blockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Cover">Укрытие</AppHeading>
					<p>
						Укрытие определяется между двумя оперативниками, обычно когда один из них выполняет стрельбу. Оперативник находится в укрытии, если в пределах его зоны контроля есть
						препятствующий ландшафт. Однако он не может находиться в укрытии, если другой оперативник находится в пределах 2 дюймов от него.
						<a href="#intervening">Понятие препятствия объясняется здесь</a>.
					</p>

					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0S">
							<NuxtPicture src="/images/core-rules/cover_1.png" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>В зоне контроля оперативника <strong>A</strong> есть препятствующий ландшафт, поэтому он находится в укрытии.</p>
						</figcaption>
					</figure>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/cover_2.png" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>Есть препятствующий ландшафт, но он не находится в зоне контроля оперативника <strong>A</strong>, поэтому он не в укрытии.</p>
						</figcaption>
					</figure>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/cover_3.png" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>В зоне контроля оперативника <strong>A</strong> есть ландшафт, но он не является препятствующим, поэтому оперативник не в укрытии.</p>
						</figcaption>
					</figure>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/cover_2.png" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								В зоне контроля оперативника <strong>A</strong> есть препятствующий ландшафт, но оперативник <strong>B</strong> находится в пределах 2 дюймов от оперативника
								<strong>A</strong>, поэтому он не в укрытии.
							</p>
						</figcaption>
					</figure>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote><p>Отслеживайте оставшееся здоровье каждого оперативника с помощью кубиков, жетонов или записывая значения.</p></blockquote>
					<blockquote>
						<p>Выведен из строя» и «удалён из зоны боя» — разные понятия. Некоторые правила срабатывают, когда оперативник выведен из строя, но до того, как он будет удалён.</p>
					</blockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Damage">Урон</AppHeading>

					<p>
						Когда оперативнику наносится урон, уменьшите его здоровье на соответствующее количество. Начальное количество здоровья оперативника определяется характеристикой «Здоровье» (см.
						карточки данных). Если здоровье оперативника уменьшается до 0 или ниже, он считается выведенным из строя и удаляется из зоны боя. Некоторые правила позволяют выведенному из
						строя оперативнику выполнить свободное действие перед удалением из зоны боя. Такой оперативник не может выполнить более одного свободного действия (за исключением действия
						«Установить маркер») в этом случае, и игрок, контролирующий этого оперативника, определяет порядок выполнения любых его правил, которые срабатывают до удаления из зоны боя
						(приоритет над игроком с инициативой).
					</p>

					<p>
						Пока у оперативника остаётся меньше здоровья, чем его начальное значение, он считается раненым. Если у него осталось меньше половины начального здоровья, он также считается
						тяжело раненым.
					</p>
					<AppHeading :level="4" subtitle="Injured">Тяжёлое ранение</AppHeading>
					<p><strong>У тяжело раненых оперативников уменьшите характеристику «Движение» на 2 дюйма и ухудшите характеристику «Попадание» их оружия на 1.</strong></p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote><p>Если у оперативника APL равен 2, и два правила добавляют по 1 к его APL, итоговый APL будет равен 3.</p></blockquote>
					<blockquote>
						<p>
							Если характеристики оперативника или характеристики его оружия изменяются во время выполнения действия, примените изменение после завершения действия. Обратите внимание,
							что изменения правил оружия применяются немедленно.
						</p>
					</blockquote>
					<blockquote>
						<p>
							Обратите внимание, что более высокое значение характеристик "Попадание" и "Спасбросок" хуже, так как вероятность успешного броска уменьшается. Это важно, если правило
							требует улучшить или ухудшить такую характеристику. Например, характеристика "Попадание" 4+, ухудшенная на 1, становится 5+.
						</p>
					</blockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Datacards">Карточки данных</AppHeading>
					<div class="w-full shrink-0 flex justify-center">
						<NuxtPicture src="/images/core-rules/example_datacard.jpg" format="webp" class="block mx-auto h-auto" />
					</div>

					<AppHeading :level="4" subtitle="Type of operative">1. Тип оперативника.</AppHeading>
					<AppHeading :level="4" subtitle="Operative stats">2. Характеристики оперативника:</AppHeading>
					<ul>
						<li>
							<strong>Лимит очков действий (APL):</strong> Общее количество очков действий, которое оперативник может использовать во время своей активации, а также характеристика,
							используемая для определения контроля над маркерами. Некоторые редкие правила могут изменять APL оперативника. Независимо от количества изменений APL, общее значение не
							может превышать +1 или -1 от его нормального APL. Это имеет приоритет над всеми изменениями характеристик.
						</li>
						<li>
							<strong>Движение (MOVE):</strong> Дистанция передвижения оперативника, используемая при выполнении действий <strong>"Перемещение"</strong>, <strong>"Отступление"</strong> и
							<strong>"Натиск"</strong>. Характеристика "Движение" оперативника не может быть снижена менее чем до 4 дюймов. Это имеет приоритет над всеми изменениями характеристик.
						</li>
						<li><strong>Спасбросок (SAVE):</strong> Результат, необходимый для успешного броска кубиков защиты, когда другой оперативник стреляет по данному оперативнику.</li>
						<li><strong>Раны (WOUNDS):</strong> Начальное количество ран оперативника, которое уменьшается по мере нанесения урона.</li>
					</ul>
					<AppHeading :level="4" subtitle="Weapon stats">3. Характеристики оружия:</AppHeading>
					<p>
						Страницы выбора ударной команды в правилах вашей ударной команды указывают, какое оружие имеет оперативник. Если это не указано, оперативник обладает всем оружием, указанным в
						его карточке данных.
					</p>
					<ul>
						<li>
							<p>Тип оружия &ndash; стрелковое или ближнего боя.</p>
						</li>
						<li>
							<p><strong>Атака (ATK):</strong> Количество кубиков атаки, которое нужно бросить, когда оперативник использует это оружие.</p>
						</li>
						<li>
							<p><strong>Попадание (HIT):</strong> Результат, необходимый для успешного броска кубиков атаки, когда оперативник использует это оружие.</p>
						</li>
						<li>
							<p>
								<strong>Урон (DMG):</strong> Урон, наносимый каждым кубиком атаки при использовании этого оружия. Первое значение &mdash; это характеристика "Обычный урон" (урон от
								обычного успеха), второе значение &mdash; характеристика "Критический урон" (урон от критического успеха).
							</p>
						</li>
						<li>
							<p>
								Иногда разные виды оружия имеют одинаковое основное название, но разные второстепенные названия, указанные в скобках, например, "плазменная пушка (стандарт)" и
								"плазменная пушка (сверхзаряд)". Это фактически отдельные профили одного и того же оружия, но используемые как разные виды оружия. Если правило ссылается только на
								основное название, оно включает все виды оружия с этим основным названием.
							</p>
						</li>
					</ul>
					<AppHeading :level="4" subtitle="Weapon rules">4. Правила оружия:</AppHeading>
					<ul>
						<li>Дополнительные правила, применяемые, когда оперативник использует это оружие, объяснены здесь.</li>
					</ul>
					<AppHeading :level="4" subtitle="Additional rules">5. Дополнительные правила:</AppHeading>
					<ul>
						<li>Дополнительные правила, которые имеет оперативник.</li>
						<li>Уникальные действия, которые может выполнять этот оперативник.</li>
					</ul>
					<AppHeading :level="4" subtitle="Keywords">6. Ключевые слова:</AppHeading>
					<ul>
						<li>- Используются для идентификации оперативника в правилах — некоторые правила действуют только на оперативников с соответствующими ключевыми словами.</li>
						<li>- Указаны шрифтом КЛЮЧЕВОЕ СЛОВО.</li>
						<li>
							- Ключевые слова, выделенные оранжевым цветом с символом черепа, например,
							<span class="text-orange-500 font-bold">TEMPESTUS AQUILON <Icon name="mdi:skull" class="align-middle" /> </span>, являются фракционными ключевыми словами — используются для
							идентификации всех оперативников данной ударной команды.
						</li>
					</ul>
					<AppHeading :level="4" subtitle="Base size in mm">7. Размер базы в мм.</AppHeading>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>Например, если требуется 4+, результат кубика 4, 5 или 6 удовлетворяет условию, а если требуется 1–4, то результат кубика 1, 2, 3 или 4 удовлетворяет условию.</p>
					</blockquote>
				</template>
				<template #right
					><AppHeading :level="3" subtitle="Dice">Кубики</AppHeading>
					<p>
						Используйте шестигранные кубики (D6) для определения исхода различных правил. Часто требуется результат x+, где x — минимально допустимое значение, например, 3+. Иногда
						требуется результат в определённом диапазоне, например, 1–3. Некоторые редкие правила требуют броска D3: для этого бросьте один D6 и разделите результат пополам (округляя
						вверх). Некоторые правила требуют броска xD6 или xD3 (например, 2D6 или 3D3): бросьте указанное количество кубиков и сложите результаты. Также могут быть правила вида D6+x или
						D3+x (например, D6+2 или D3+3): бросьте соответствующий кубик и добавьте к результату x.
					</p>
					<p>
						Некоторые правила позволяют перебросить кубик. Нельзя перебрасывать кубик более одного раза, а также нельзя выбрать исходный результат, даже если новый результат хуже. Если это
						кубики атаки или защиты, переброс можно выполнять в любом порядке, включая возможность увидеть результат одного переброса перед принятием решения о следующем. Если несколько
						игроков могут перебросить кубики одновременно (например, во время действия "Рукопашный бой"), они поочерёдно либо перебрасывают кубик, либо пасуют, пока оба не пасуют подряд,
						начиная с игрока с инициативой (это имеет приоритет над правилами жеребьёвки, которые происходят одновременно, стр. 37).
					</p></template
				>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>Оперативники, находящиеся в пределах определённого расстояния от оперативника, несущего маркер, также находятся в пределах того же расстояния от этого маркера.</p>
					</blockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Distances">Расстояния</AppHeading>
					<p>
						Различные правила требуют соблюдения расстояния в дюймах. При измерении расстояния до или от объекта измеряйте от ближайшей его части. Для оперативника измерение проводится от
						его базы, игнорируя все остальные части миниатюры. При измерении до или от области зоны боя учитывайте только горизонтальное расстояние (иными словами, смотрите сверху,
						игнорируя вертикальное расстояние).
					</p>
					<p>
						Если правило требует, чтобы объект находился «в пределах» определённого расстояния, условие выполняется, если хотя бы часть объекта находится на этом расстоянии или ближе. Для
						условия «полностью в пределах» расстояния каждая часть объекта должна находиться на этом расстоянии или ближе. Оперативник всегда считается находящимся «в пределах» и
						«полностью в пределах» расстояния до самого себя и маркера, который он несёт. Если оперативник несёт миссионный или целевой маркер, этот маркер находится на том же расстоянии,
						что и оперативник.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/distances.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Оперативник <strong>B</strong> находится в пределах 2" от оперативника <strong>A</strong>. Целевой маркер находится в пределах 2" от оперативника <strong>A</strong>.
								Оперативник <strong>C</strong> находится полностью в пределах 2" от оперативника <strong>A</strong>.
							</p>
						</figcaption>
					</figure>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right>
					<AppHeading :level="3" subtitle="Equipment">Снаряжение</AppHeading>
					<p>Снаряжение — это дополнительные правила, которые можно выбрать перед битвой, как указано в последовательности игры (например здесь).</p>
					<p>Универсальное снаряжение доступно для любой ударной команды, тогда как фракционное снаряжение специфично для определённой фракции.</p>
					<p>Каждый игрок не может выбрать одну и ту же опцию снаряжения более одного раза за игру.</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>
							Игрок оперативника решает, от какой точки базы проводить линии прицеливания. Это может позволить оперативнику выбрать более выгодный угол — представьте, что оперативник
							наклоняется вправо или влево, как это уместно.
						</p>
					</blockquote>
					<blockquote>
						<p>
							Препятствие обычно определяется от одного оперативника к другому, но некоторые редкие правила могут требовать определения препятствия относительно других объектов, таких
							как маркеры. В таких случаях все части этого объекта считаются «базой» при определении препятствия.
						</p>
					</blockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Intervening">Препятствие</AppHeading>
					<p>
						Правила, такие как укрытие и заслонение, требуют определения, является ли что-либо препятствием, например, ландшафт. В большинстве случаев это легко определить — если объект
						находится между оперативником и предполагаемой целью, он считается препятствием. Иногда это может быть неочевидно, поэтому используются линии прицеливания.
					</p>
					<p>
						Для использования линий прицеливания игрок, контролирующий оперативника, проводит воображаемые прямые линии диаметром 1 мм от любой точки базы оперативника ко всем видимым
						частям базы предполагаемой цели. Всё, что пересекает хотя бы одна из этих линий, считается препятствием. Всё, что пересекают все эти линии, считается полностью препятствующим.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0S">
							<NuxtPicture src="/images/core-rules/intervening_1.png" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>Линии прицеливания пересекают ландшафт, поэтому он является препятствием.</p>
						</figcaption>
					</figure>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0S">
							<NuxtPicture src="/images/core-rules/intervening_2.png" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>Из-за того, как игрок оперативника A решил провести линии прицеливания, ландшафт не является препятствием.</p>
						</figcaption>
					</figure>
					<p>
						Чаще всего линии прицеливания можно проводить в двумерной плоскости (вид сверху) для удобства. Однако, если между оперативниками есть разница в высоте (например, один из них
						находится на ландшафте типа "Высота"), линии прицеливания следует проводить в трёхмерной плоскости.
					</p>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0S">
							<NuxtPicture src="/images/core-rules/intervening_3.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>Ни одна из этих линий прицеливания не пересекает элемент ландшафта A, поэтому он не является препятствием.</p>
						</figcaption>
					</figure>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right
					><AppHeading :level="3" subtitle="Keywords">Ключевые слова</AppHeading>

					<p>
						Ключевые слова — это способ идентификации определённых правил. Чаще всего ключевые слова используются для оперативников (см. карточки данных ) — некоторые правила затрагивают
						только оперативников с соответствующими ключевыми словами.
					</p>
					<p>
						Некоторые редкие правила также имеют ключевые слова, например, <strong>ПОДДЕРЖКА</strong> или <strong>СТРАТЕГИЧЕСКИЙ МАНЁВР</strong>. Сами по себе эти ключевые слова ничего не
						означают, но другие правила взаимодействуют с ними. Ключевые слова выделяются <strong>ЖИРНЫМ ШРИФТОМ КЛЮЧЕВОГО СЛОВА</strong>. Те, что выделены оранжевым цветом с символом
						черепа, например, <span class="text-orange-500 font-bold">TEMPESTUS AQUILON <Icon name="mdi:skull" class="align-middle" /> </span>, являются фракционными ключевыми словами,
						используемыми для идентификации всех оперативников/правил данной ударной команды.
					</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right
					><AppHeading :level="3" subtitle="Killzone Floor">Пол зоны боя</AppHeading>
					<p>
						Пол зоны боя — это поверхность зоны боя (т.е. игровая доска). Всё, что находится на маркере, расположенном на полу зоны боя, также считается находящимся на полу зоны боя.
					</p></template
				>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<figure class="m-0 flex flex-col items-center justify-center">
							<div class="w-full shrink-0S">
								<NuxtPicture src="/images/core-rules/kt__0001_objective_marker_example.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>Маркеры целей — наиболее распространённые маркеры, представляющие ключевые точки в зоне боя. Контроль над ними часто необходим для достижения победы.</p>
							</figcaption>
						</figure>
					</blockquote>
					<blockquote>
						<figure class="m-0 flex flex-col items-center justify-center">
							<div class="w-full shrink-0S">
								<NuxtPicture src="/images/core-rules/kt__0000_represent_a_marker.png" format="webp" class="w-full h-auto" />
							</div>
							<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
								<p>
									Допустимо использовать миниатюру для представления маркера, но имейте под рукой стандартный маркер, если это вызывает проблемы с правилами (например, миниатюра
									слишком большая).
								</p>
							</figcaption>
						</figure>
					</blockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Markers">Маркеры</AppHeading>
					<p>
						Маркеры размещаются в строго определённых местах — это должно быть место, где их можно установить, и они оказывают влияние на игру и оперативников вокруг. Маркеры могут быть
						размещены под оперативниками (временно уберите оперативников для этого), а оперативники могут быть размещены на маркерах. Маркеры целей имеют диаметр 40 мм. Все остальные
						маркеры имеют диаметр 20 мм. Некоторые маркеры называются миссионными маркерами. Само по себе это ничего не означает, но с ними взаимодействуют другие правила.
					</p>
					<p>
						Оперативники оспаривают маркеры в пределах своей зоны контроля. Дружественные оперативники контролируют маркер, если суммарный лимит очков действий (APL) тех, кто его
						оспаривает, превышает суммарный APL вражеских оперативников, но контроль не может измениться во время выполнения действия. Пока оперативник несёт маркер (см. действие «Поднять
						маркер» ), он оспаривает и контролирует этот маркер и является единственным оперативником, который может это делать.
					</p>

					<figure class="m-0 flex flex-col items-center justify-center">
						<div class="w-full shrink-0S">
							<NuxtPicture src="/images/core-rules/marker_place_example.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-0 flex-1">
							<p>
								В приведённом выше примере только три оперативника оспаривают маркер цели, так как он находится вне зоны контроля оранжевого оперативника слева (элемент ландшафта
								препятствует видимости). Суммарный APL оранжевых оперативников, оспаривающих маркер цели, равен 2, тогда как суммарный APL белых оперативников, оспаривающих его, равен
								4, поэтому маркер контролируют белые оперативники.
							</p>
						</figcaption>
					</figure>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<div class="flex flex-col justify-between h-full">
						<blockquote>
							<p>
								Заслонение происходит, когда оперативник является допустимой целью, но препятствия (обычно ландшафт) делают его менее эффективной целью. Представьте, что оперативнику
								приходится целиться во врага через руины или дальнее окно.
							</p>
						</blockquote>
						<blockquote>
							<p>
								Другими словами, нахождение оперативника в пределах 1 дюйма от элемента ландшафта не предотвращает заслонение этим элементом, за исключением той части ландшафта,
								которая находится в пределах 1 дюйма от оперативника.
							</p>
						</blockquote>
					</div>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Obscured">Заслонение</AppHeading>
					<p>
						Заслонение определяется между одним оперативником и другим, обычно когда один из них выполняет стрельбу. Оперативник считается заслонённым, если между ними находится
						препятствующий тяжёлый ландшафт. Однако заслонение не происходит, если препятствующий тяжёлый ландшафт находится в пределах 1 дюйма от любого из оперативников. Подробности о
						препятствиях описаны здесь.
					</p>
					<ul>
						<p>Когда оперативник выполняет стрельбу, если цель заслонена:</p>
						<li>Атакующий должен сбросить один успех по своему выбору вместо того, чтобы сохранить его.</li>
						<li>Все критические успехи атакующего сохраняются как обычные успехи и не могут быть преобразованы в критические успехи (это имеет приоритет над всеми другими правилами).</li>
					</ul>

					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/obscured_1.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Оперативник <strong>B</strong> виден оперативнику <strong>A</strong> через окно. Однако между ними находится препятствующий тяжёлый ландшафт, расположенный далее 1
								дюйма от обоих оперативников, поэтому оперативник <strong>B</strong> заслонён.
							</p>
						</figcaption>
					</figure>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/obscured_2.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Между оперативниками находится препятствующий тяжёлый ландшафт, но он расположен в пределах 1 дюйма от оперативника <strong>A</strong>, поэтому оперативник
								<strong>B</strong> не заслонён.
							</p>
						</figcaption>
					</figure>
					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/obscured_3.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p>
								Между оперативниками находится препятствующий тяжёлый ландшафт, часть которого находится в пределах 1 дюйма, а часть — за его пределами. Поскольку часть ландшафта
								находится вне 1 дюйма, оперативник <strong>B</strong> заслонён.
							</p>
						</figcaption>
					</figure>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right
					><AppHeading :level="3" subtitle="Operatives">Оперативники</AppHeading>
					<p>Оперативники — это миниатюры Citadel, используемые в игре.</p>
					<p>Ваши оперативники являются дружественными оперативниками, а оперативники вашего противника — вражескими оперативниками.</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right>
					<AppHeading :level="3" subtitle="Orders">Приказы</AppHeading>

					<figure class="m-0 flex flex-col lg:flex-row items-center justify-center lg:gap-5">
						<div class="w-full lg:w-1/2 shrink-0">
							<NuxtPicture src="/images/core-rules/orders.jpg" format="webp" class="w-full h-auto" />
						</div>
						<figcaption class="text-sm mt-2 lg:mt-0 flex-1">
							<p><strong>Приказ "В бой":</strong> Оперативник может выполнять действия как обычно и может выполнять контратаку.</p>
							<p>
								<strong>Приказ "В укрытие":</strong> Оперативник не может выполнять действия «Стрельба» и «Натиск» и не может выполнять контратаку. Однако он не является допустимой
								целью, пока находится в укрытии.
							</p>
						</figcaption>
					</figure>
					<p>Оперативники получают приказ «В укрытие» при их размещении перед началом битвы. Вы можете изменить приказ оперативника каждый раз, когда он активируется.</p>
					<p>
						Жетоны приказов имеют две стороны. Светлая сторона показывает, что оперативник находится в состоянии готовности (он может быть активирован в фазе боя), а тёмная сторона
						показывает, что оперативник истощён (он уже был активирован в фазе боя).
					</p></template
				>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right
					><AppHeading :level="3" subtitle="Ploys">Хитрости</AppHeading>
					<p>
						Игроки могут тратить очки командования (CP) на хитрости, чтобы получить бонусы по правилам в подходящий момент. Если не указано иное, все хитрости стоят 1 CP. Существует два
						типа хитростей:
					</p>
					<ul>
						<li>
							Каждая <strong>стратегическая хитрость</strong> является стратегическим манёвром (используется в фазе стратегии). Некоторые применяют правила, которые разрешаются
							«немедленно», в противном случае они применяют правила, действующие до конца хода игры.
						</li>
						<li><strong>Боевые хитрости</strong> используются в фазе боя и применяют правила в соответствии с описанием хитрости.</li>
					</ul>
					<p>
						Все игроки имеют доступ к боевой хитрости «Командный переброс», описанной ниже, а также к хитростям, указанным в правилах их ударной команды. За исключением «Командного
						переброса», каждый игрок не может использовать одну и ту же хитрость более одного раза за ход игры.
					</p>
					<ActionCard
						title="Командный переброс"
						subtitle="Command re-roll"
						:level="4"
						:ap="1"
						:effects="['<p>Используйте эту боевую хитрость после броска кубиков атаки или защиты.</p><p>Вы можете перебросить один из этих кубиков.</p>']"
				/></template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote>
						<p>
							Если на карточке данных указано: «этот оперативник может выполнить два действия "Стрельба" во время своей активации», это имеет приоритет над основными правилами
							ограничений на действия (Ограничения на действия описаны здесь), согласно пункту 3 приоритета.
						</p>
					</blockquote>
				</template>
				<template #right>
					<AppHeading :level="3" subtitle="Precedence">Приоритет</AppHeading>
					<p>
						Некоторые редкие правила могут вступать в конфликт друг с другом, поэтому необходимо установить, какое из них имеет приоритет. В порядке приоритета правило имеет преимущество,
						если:
					</p>
					<ol>
						<li>Это прямо указано в правиле.</li>
						<li>Это указано в комментариях дизайнера, опубликованных онлайн.</li>
						<li>Правило не содержится в основной книге правил (т.е. другие правила имеют приоритет над правилами основной книги).</li>
						<li>Правило содержит формулировку «не может».</li>
						<li>Игрок с инициативой принимает решение.</li>
					</ol>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right>
					<AppHeading :level="3" subtitle="Roll-off">Жеребьёвка</AppHeading>
					<p>Если правило требует жеребьёвки, оба игрока бросают один шестигранный кубик (D6), и побеждает тот, у кого выпало наибольшее значение.</p>
					<p>В случае ничьей проводится повторная жеребьёвка.</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote><p>Жетоны приказов являются наиболее распространёнными жетонами, они показывают приказ оперативника и его состояние — готов или истощён.</p></blockquote>
				</template>
				<template #right
					><AppHeading :level="3" subtitle="Tokens">Жетоны</AppHeading>

					<div class="w-full lg:w-1/2 shrink-0">
						<NuxtPicture src="/images/core-rules/tokens_set.jpg" format="webp" class="w-full h-auto" />
					</div>

					<p>Жетоны используются для отслеживания эффектов правил.</p>
					<p>Они обычно размещаются рядом с соответствующим оперативником, но могут быть перемещены, чтобы освободить место для других оперативников и маркеров, если это необходимо.</p>
					<p>Жетоны убираются, когда отслеживаемый эффект правила прекращается.</p>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #right
					><AppHeading :level="3" subtitle="Valid Target">Допустимая цель</AppHeading>

					<p>
						Некоторые правила требуют выбора допустимой цели для оперативника. Это наиболее распространено, когда оперативник выполняет стрельбу, но некоторые редкие правила также могут
						это требовать.
					</p>

					<ul>
						<li>Если предполагаемая цель имеет приказ <strong>«В бой»</strong>, она является допустимой целью, если она видима для оперативника.</li>
						<li>Если предполагаемая цель имеет приказ <strong>«В укрытие»</strong>, она является допустимой целью, если она видима для оперативника и не находится в укрытии.</li>
					</ul>
				</template>
			</TwoColumnLayout>

			<TwoColumnLayout>
				<template #left>
					<blockquote><p></p></blockquote>
				</template>
				<template #right> <AppHeading :level="3" subtitle="Visible">Видимость</AppHeading></template>
			</TwoColumnLayout>

			<!--  -->

			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />

			<!--  -->

			<AppHeading :level="2" subtitle="Killzones">Зоны боя</AppHeading>
			<AppHeading :level="3" subtitle="Terrain and Movement">Ландшафт и передвижение</AppHeading>
			<AppHeading :level="4" subtitle="Climbing">Взобраться</AppHeading>
			<AppHeading :level="4" subtitle="Dropping">Спуститься</AppHeading>
			<AppHeading :level="4" subtitle="Jumping">Прыгнуть</AppHeading>
			<AppHeading :level="3" subtitle="Terrain Types">Типы ландшафта</AppHeading>
			<AppHeading :level="4" subtitle="Heavy">Тяжёлый</AppHeading>
			<AppHeading :level="4" subtitle="Light">Лёгкий</AppHeading>
			<AppHeading :level="4" subtitle="Blocking">Блокирующий</AppHeading>
			<AppHeading :level="4" subtitle="Vantage">Высота</AppHeading>
			<AppHeading :level="4" subtitle="Accessible">Проходимый</AppHeading>
			<AppHeading :level="4" subtitle="Insignificant">Незначительный</AppHeading>
			<AppHeading :level="4" subtitle="Exposed">Открытый</AppHeading>

			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="3" subtitle="Killzone: Volkus">Зона боя: Волкус</AppHeading>
			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="3" subtitle="Killzone: Gallowdark">Зона боя: Галлоударк</AppHeading>
			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="3" subtitle="Killzone: Bheta-Decima">Зона боя: Бета-Десима</AppHeading>
			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<AppHeading :level="3" subtitle="Killzone: Tomb World">Зона боя: Мир Гробниц</AppHeading>
			<!--  -->
			<USeparator color="zinc" type="dotted" class="opacity-30 mt-12" />
			<!--  -->
			<AppHeading :level="3" subtitle="Setting Up Killzones">Подготовка Killzone</AppHeading>
		</article>
		<USeparator type="dashed" class="h-px" />
		<AppFooter />
		<TableOfContents :items="items" :active-id="activeId" @navigate="scrollTo" />
	</UContainer>
</template>

<style scoped></style>

<!-- 
arcticons:eksi-sozluk
arcticons:shield


material-symbols:circle
ri:triangle-fill


material-symbols:arrow-back-2
f7:rhombus-fill
  -->

<!-- 

<ActionCard
					title=""
					subtitle=""
					:ap="1"
					:effects="['']"
					:conditions="['']"
					/>

-->
